org-publish.org
* Fichero =makefile=

Genera el directorio =docs= con los ficheros para GitPages con subdirectorios para los =CuadernosElectronicos=, =pdfs=, =Transparencias= y los ficheros con las lecciones en ~html~.

#+BEGIN_SRC makefile :noweb no-export :results silent :tangle makefile
LECCIONES_SRC = ./org-lessons
LECCIONES_tmp = ./Lecciones-tmp
PRACTICAS_SRC = ./org-practicas
PRACTICAS_tmp = ./Practicas-tmp
DOCS = ./docs
CUADERNOS = $(DOCS)/CuadernosElectronicos
TRANSPARENCIAS = $(DOCS)/Transparencias

SRC_FILES = $(LECCIONES_SRC)/*.org
# SRC_FILES = $(LECCIONES_SRC)/Lecc*.org
# SRC_PRACTICAS_PYTHON_FILES = $(LECCIONES_SRC)/P-L.org

#.PHONY: cleanAll directorios programas_de_python calendario notebooksYslides limpia_kernels_jupyter practicas publicacion limpia_kernels_jupyter

all: calendario notebooksYslides practicas  publicacion-lecciones publicacion-practicas publicacion limpia_kernels_jupyter

calendario: directorios $(DOCS)/Calendario-Econometria-Aplicada.pdf

REPO_URL = https://github.com/mbujosab/TimeSeriesData
DATOS_DIR = ./datos/
TEMP_DIR = ../TimeSeriesData_temp

copia_datos: $(DATOS_DIR)
	@echo "Clonando el repositorio $(REPO_URL) con profundidad 1..."
	# 1. Clonar el repositorio en un directorio temporal SEGURO
	@git clone --depth 1 $(REPO_URL) $(TEMP_DIR)
	@echo "Copiando archivos y directorios sin la extensión .org, .git o .projectile a $(DATOS_DIR) (manteniendo estructura)..."
	# 2. **CRÍTICO:** Bloque condicional de rsync con exclusiones mejoradas
	@if [ -d "$(TEMP_DIR)" ]; then \
		rsync -av \
			--exclude '*/.git*' \
			--exclude '*.org' \
			--exclude '.*' \
			--include '*/' \
			--include '*' \
			"$(TEMP_DIR)/" "$(DATOS_DIR)"; \
	else \
		echo "ERROR: Falló la clonación. Directorio fuente ($(TEMP_DIR)) no encontrado. NO se copió nada." 1>&2; \
	fi
	@echo "Limpiando directorio temporal..."
	# 3. Eliminar el directorio temporal clonado
	@rm -rf "$(TEMP_DIR)"
	@echo "Copia de archivos y estructura completada."

$(DATOS_DIR):
	@mkdir -p $(DATOS_DIR)


$(DOCS)/Calendario-Econometria-Aplicada.pdf:
	emacs --batch Calendario/README.org -l org -f org-babel-tangle
	cd Calendario && make Calendario-Econometria-Aplicada.pdf

publicacion:
	cp -a README.org  $(DOCS)
	mkdir -p $(DOCS)/Practicas-html/img
	find . -wholename $(LECCIONES_tmp)/P-L*.pdf -exec cp {} $(DOCS)/Practicas-pdf/ \;
	find . -wholename $(LECCIONES_tmp)/P-L*.html -exec cp {} $(DOCS)/Practicas-html/ \;
	cp -a $(DOCS)/Lecciones-html/img/P-L* $(DOCS)/Practicas-html/img/
	cp -a $(DOCS)/Lecciones-html/P-L*.html $(DOCS)/Practicas-html/
#	find $(DOCS)/Lecciones-html/img/ -maxdepth 1 -type d -name "P-L*" -exec cp -a {}  $(DOCS)/Practicas-html/img/ \;
#	find $(DOCS)


# Defino las rutas de origen y destino para mayor claridad
SRC_IMG = $(DOCS)/Lecciones-html/img/ 
DST_IMG = $(DOCS)/Practicas-html/img/

# Para crear los enlaces simbólicos de las prácticas en Python
img_symlink_files:
	files=$(shell find $(SRC_IMG) -name *.png); \
	for file in $$files; do \
		if [ -e "$$file" ]; then \
			base_name=$$(basename "$$file" .png); \
			echo "Procesando archivo: $$file"; \
			ln -snf ../$$file "$(DST_IMG)$$base_name.png"; \
			echo "Enlace creado: $(DST_IMG)$$base_name.png -> ../$$file"; \
		else \
			echo "Archivo: $$file no existe"; \
		fi; \
	done


publicacion-lecciones: $(patsubst $(LECCIONES_SRC)/%.org,$(CUADERNOS)/%.ipynb,$(wildcard $(SRC_FILES))) README.org index.org
	echo "FICHEROS EN CuadernosElectronicos y Transparencias?..."
	cp -a $(LECCIONES_tmp)/Lecc*.slides.html $(TRANSPARENCIAS)
	find . -wholename $(LECCIONES_tmp)/P-L*.slides.html -exec cp {} $(TRANSPARENCIAS)/ \;
#	#cp -a $(LECCIONES_tmp)/P-L*.slides.html $(TRANSPARENCIAS)
	ls $(CUADERNOS)
	ls $(TRANSPARENCIAS)
	echo "EJECUCIÓN DE publica.el..."
	emacs --batch \
	  --load ~/Software/scimax/init.el \
	  -l publica.el
	touch $@
#	echo "FICHEROS EN Docs?..."
#	find $(DOCS)/Lecciones-html
#	find $(DOCS)/Lecciones-pdf

publicacion-practicas: $(patsubst $(PRACTICAS_SRC)/%.org,$(CUADERNOS)/%.ipynb,$(wildcard $(SRC_FILES))) README.org index.org
	echo "EJECUCIÓN DE publica-practicas.el..."
	emacs --batch \
	  --load ~/Software/scimax/init.el \
	  -l publica-practicas.el
	echo "FICHEROS EN Docs?..."
	cp -a $(PRACTICAS_SRC)/LicenciaGuionesGretl/COPYING $(DOCS)/Practicas-html/guiones/
	touch $@
#	find $(DOCS)/Practicas-html
#	find $(DOCS)/Practicas-pdf

licencia: 
	cp -a $(PRACTICAS_SRC)/LicenciaGuionesGretl/COPYING $(DOCS)/Practicas-html/guiones/

notebooksYslides: $(patsubst $(LECCIONES_SRC)/%.org,$(CUADERNOS)/%.ipynb,$(wildcard $(SRC_FILES)))
	touch $@
#	pkill -f "python3 -m ipykernel_launcher"

$(CUADERNOS)/%.ipynb $(TRANSPARENCIAS)/%.slides.html: $(LECCIONES_SRC)/%.org
	make directorios
	make programas_de_python
#	make symlink_files
	cp -a $(LECCIONES_SRC)/*.bib $(LECCIONES_tmp)
	cp -a $< $(LECCIONES_tmp)
	echo "EJECUCION DEL NOTEBOOK DE ORG: $(LECCIONES_tmp)/$(@F:.ipynb=.org)..."
	emacs -Q -l ~/Software/scimax/init.el $(LECCIONES_tmp)/$(@F:.ipynb=.org) --batch --eval "(org-babel-execute-buffer)" --eval "(save-buffer)" --kill
	cp -a $(LECCIONES_tmp)/$(@F) $(CUADERNOS)
	echo "EJECUCION DEL NOTEBOOK DE JUPYTER..."
	jupyter nbconvert --execute --inplace $(LECCIONES_tmp)/$(@F) 
	echo "FICHEROS EN ./lecciones?..."
#	find $(LECCIONES_tmp)
	echo "FICHEROS EN ./docs/Lecciones-html/img?..."
	cp -a $(LECCIONES_tmp)/img $(DOCS)/Lecciones-html
#	find $(DOCS)/Lecciones-html/img
	echo "Contenido de img tras notebook:"
#	find $(LECCIONES_tmp)/img
	echo "COPIO LO QUE SE HA GENERADO (.ipynb sin ejecutar y las imágenes) A ./docs..."
	ln -snf -r $(DOCS)/Lecciones-html/img/ $(TRANSPARENCIAS)/
	ln -snf -r $(DOCS)/Lecciones-html/img/ $(CUADERNOS)/
#	# Ejecutar el notebook con jupyter nbconvert
	echo "CREACIÓN DE LAS SLIDES..."
	jupyter nbconvert --config mycfg-GitHubPages.py --to slides --reveal-prefix "https://unpkg.com/reveal.js@5.2.1" --execute $(LECCIONES_tmp)/$(@F) 
	echo "➡️ FICHEROS EN docs/ TRAS GENERAR SLIDES Y NOTEBOOKS DE JUPYTER..."
#	find $(DOCS)



# Define las rutas de origen y destino para mayor claridad
SRC_DIR_PRACTICAS =./org-practicas/     # ./org-practicas/
DST_DIR_PRACTICAS =./org-lessons/

# Para crear los enlaces simbólicos de las prácticas en Python
symlink_files:
	files=$(shell find $(SRC_DIR_PRACTICAS) -name *.txt); \
	for file in $$files; do \
		if [ -e "$$file" ]; then \
			base_name=$$(basename "$$file" .txt); \
			echo "Procesando archivo: $$file"; \
			ln -snf ../$$file "$(DST_DIR_PRACTICAS)$$base_name.org"; \
			echo "Enlace creado: $(DST_DIR_PRACTICAS)$$base_name.org -> ../$$file"; \
		else \
			echo "Archivo: $$file no existe"; \
		fi; \
	done



# Lista de archivos fuente .org en org-practicas
PRACTICAS_ORG = $(wildcard org-practicas/*.org)

# Ficheros .done como señal de que fueron tanglados
PRACTICAS_DONE = $(patsubst org-practicas/%.org, $(PRACTICAS_tmp)/%.done, $(PRACTICAS_ORG))

# Objetivo principal de las prácticas en Gretl
practicas: figuras_de_lecciones $(PRACTICAS_DONE)
	@echo "✅ Todas las prácticas actualizadas."

$(PRACTICAS_tmp)/%.done: org-practicas/%.org
	echo "➡️ Copiando y ejecutando $< ..."
	mkdir -p $(PRACTICAS_tmp)/guiones
	cp $< $(PRACTICAS_tmp)/
	mkdir -p $(PRACTICAS_tmp)/src
	cp $(LECCIONES_tmp)/src/*.py $(PRACTICAS_tmp)/src
	ln -snf -r $(LECCIONES_tmp)/datos $(PRACTICAS_tmp)/
	cp -a org-practicas/hansl.tex $(PRACTICAS_tmp)/
	echo "🧠 Ejecutando org-babel-tangle y eval..."
	set -e; \
	if emacs --batch \
	  --load ~/Software/scimax/init.el \
	  $(PRACTICAS_tmp)/$*.org \
	  --eval "(org-babel-execute-buffer)" \
	  --eval "(save-buffer)" \
	  --kill; then \
	    echo "✅ Correcto: $<"; \
	    touch $@; \
	else \
	    echo "❌ Error al procesar $<"; \
	    rm -f $@; \
	    exit 1; \
	fi
	echo "➡️ listado de ficheros en el subdirectorio guiones"
	ls -lR $(PRACTICAS_tmp)/guiones  # Debug para Actions

figuras_de_lecciones:
	cp -a $(LECCIONES_tmp)/img/lecc04/MA2roots.png $(PRACTICAS_tmp)/img/
	cp -a $(LECCIONES_tmp)/img/lecc04/ACF-MA1p.png $(PRACTICAS_tmp)/img/
	cp -a $(LECCIONES_tmp)/img/lecc05/ACF-AR1p.png $(PRACTICAS_tmp)/img/
	cp -a $(LECCIONES_tmp)/img/lecc05/AR2roots.png $(PRACTICAS_tmp)/img/
	cp -a $(LECCIONES_tmp)/img/lecc03/IBEX35.png   $(PRACTICAS_tmp)/img/
	cp -a $(LECCIONES_tmp)/img/lecc07/ACF-RW.png   $(PRACTICAS_tmp)/img/

ORG_FILES := $(wildcard $(LECCIONES_SRC)/src/*.org)
TMP_FILES := $(patsubst $(LECCIONES_SRC)/src/%.org, $(LECCIONES_tmp)/src/%.org, $(ORG_FILES))

programas_de_python: $(TMP_FILES)

$(LECCIONES_tmp)/src/%.org: $(LECCIONES_SRC)/src/%.org
	echo "INICIO $*.ipynb..."
	make directorios
	cp $< $(LECCIONES_tmp)/src/
	emacs -q --batch $(LECCIONES_tmp)/src/$*.org -l org -f org-babel-tangle
	cp -a $(LECCIONES_tmp)/src/$*.py $(CUADERNOS)/src/
	ln -sf -r $(CUADERNOS)/src/$*.py $(CUADERNOS)/
	emacs -Q -l ~/Software/scimax/init.el $(LECCIONES_tmp)/$(@F:.ipynb=.org) --batch --eval "(org-babel-execute-buffer)" --eval "(save-buffer)" --kill
	emacs -q --batch \
	  --load ~/Software/scimax/init.el \
	  --eval "(require 'ox-ipynb)" \
	  --eval "(ox-ipynb-export-org-file-to-ipynb-file \"$(LECCIONES_tmp)/src/$*.org\")"
	jupyter nbconvert --execute --inplace $(LECCIONES_tmp)/src/$*.ipynb
	jupyter nbconvert --config mycfg-GitHubPages.py --to slides --reveal-prefix "https://unpkg.com/reveal.js@5.2.1" --execute $(LECCIONES_tmp)/src/$*.ipynb
	jupyter nbconvert --execute --to html $(LECCIONES_tmp)/src/$*.ipynb
	cp -a $(LECCIONES_tmp)/src/$*.ipynb $(CUADERNOS)
	cp -a $(LECCIONES_tmp)/src/$*.slides.html $(TRANSPARENCIAS)
	cp -a $(LECCIONES_tmp)/src/$*.html $(DOCS)/Lecciones-html/src/
	echo "TERMINADO $*.ipynb..."

directorios:
	mkdir -v -p .github/workflows
	mkdir -v -p $(LECCIONES_tmp)/src
	mkdir -v -p $(LECCIONES_tmp)/img
	mkdir -v -p $(PRACTICAS_tmp)/img
	mkdir -v -p $(DOCS)/Lecciones-pdf
	mkdir -v -p $(DOCS)/.binder
	mkdir -v -p $(DOCS)/Lecciones-html/img
	mkdir -v -p $(DOCS)/Lecciones-html/src
	mkdir -v -p $(TRANSPARENCIAS)
	mkdir -v -p $(CUADERNOS)/src
	cp -a ./css $(LECCIONES_tmp)/
	cp -a ./datos $(LECCIONES_tmp)/
	cp -a ./datos $(DOCS)/
	cp -a ./org-lessons/00preambulo_lecciones.txt $(LECCIONES_tmp)/
	cp -a ./org-practicas/00preambulo_practicas.txt $(PRACTICAS_tmp)/
	cp -a ./figurasGretl $(LECCIONES_tmp)/img/
	touch directorios

clean:
	rm -r -f $(LECCIONES_tmp)
	rm -r -f $(PRACTICAS_tmp)

cleanAll: clean
	#find $(DOCS)/ -mindepth 1 ! -name 'README.org' ! -name '.binder' -exec rm -rf {} +
	rm -r -f $(DOCS)
	rm -f directorios
	rm -f series_formales
	rm -f publicacion-lecciones
	rm -f publicacion-practicas
	rm -f practicas
	rm -f notebooksYslides
	rm -f sitemap.org
	rm -r -f logs

limpia_kernels_jupyter:
	pkill -f "python3 -m ipykernel_launcher"
	# pkill -f "python3 -m ipykernel_launcher -f /home/marcos/.local/share/jupyter/runtime/kernel-.*\.json"

#+END_SRC

