org-publish.html
<div id="table-of-contents" role="doc-toc">
<h2>&Iacute;ndice</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgd36361e">Fichero <code>makefile</code></a>
<ul>
<li><a href="#orga80c0ea">Aclaraciones</a></li>
</ul>
</li>
<li><a href="#orga6e0032">Fichero <code>build.yml</code></a>
<ul>
<li><a href="#orged6d0fc">Aclaraciones</a>
<ul>
<li><a href="#org237dad2">Consulta a Copilot sobre la generación de figuras</a></li>
<li><a href="#orga8060aa">Consulta sobre los núcleos de Jupyter</a></li>
<li><a href="#orgfc89a62">GitHub tokens</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org002f7dd">Script <code>publica.el</code> de elisp para publicar las lecciones con formato <code>.org</code> como ficheros con formato <code>pdf</code> y <code>html</code></a></li>
<li><a href="#org0826d3c">Script <code>publica-practicas.el</code> de elisp para publicar las prácticas con formato <code>.org</code> como ficheros con formato <code>pdf</code> y <code>html</code></a></li>
<li><a href="#orgd0f31b6">slides para GitHubpages</a></li>
<li><a href="#org242c09f">Directorio <code>.binder</code> para MyBinder</a>
<ul>
<li><a href="#org0a7e471">Fichero <code>environment.yml</code></a></li>
<li><a href="#org46ddf4c">Fichero <code>apt.txt</code></a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgd36361e" class="outline-2">
<h2 id="orgd36361e">Fichero <code>makefile</code></h2>
<div class="outline-text-2" id="text-orgd36361e">
<p>
Genera el directorio <code>docs</code> con los ficheros para GitPages con subdirectorios para los <code>CuadernosElectronicos</code>, <code>pdfs</code>, <code>Transparencias</code> y los ficheros con las lecciones en <code>html</code>.
</p>

<div class="org-src-container">
<pre class="src src-makefile"><code><span style="font-weight: bold; font-style: italic;">LECCIONES_SRC</span> = ./org-lessons
<span style="font-weight: bold; font-style: italic;">LECCIONES_tmp</span> = ./Lecciones-tmp
<span style="font-weight: bold; font-style: italic;">PRACTICAS_SRC</span> = ./org-practicas
<span style="font-weight: bold; font-style: italic;">PRACTICAS_tmp</span> = ./Practicas-tmp
<span style="font-weight: bold; font-style: italic;">DOCS</span> = ./docs
<span style="font-weight: bold; font-style: italic;">CUADERNOS</span> = $(<span style="font-weight: bold; font-style: italic;">DOCS</span>)/CuadernosElectronicos
<span style="font-weight: bold; font-style: italic;">TRANSPARENCIAS</span> = $(<span style="font-weight: bold; font-style: italic;">DOCS</span>)/Transparencias

<span style="font-weight: bold; font-style: italic;">SRC_FILES</span> = $(<span style="font-weight: bold; font-style: italic;">LECCIONES_SRC</span>)/*.org
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">SRC_FILES = $(</span><span style="font-weight: bold; font-style: italic;">LECCIONES_SRC</span><span style="font-weight: bold; font-style: italic;">)/Lecc*.org
</span><span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">SRC_PRACTICAS_PYTHON_FILES = $(</span><span style="font-weight: bold; font-style: italic;">LECCIONES_SRC</span><span style="font-weight: bold; font-style: italic;">)/P-L.org
</span>
<span style="font-weight: bold; font-style: italic;">#</span><span style="font-weight: bold; font-style: italic;">.PHONY: cleanAll directorios programas_de_python calendario notebooksYslides limpia_kernels_jupyter practicas publicacion limpia_kernels_jupyter
</span>
<span style="font-weight: bold;">all</span>: calendario notebooksYslides practicas  publicacion-lecciones publicacion-practicas publicacion limpia_kernels_jupyter

<span style="font-weight: bold;">calendario</span>: directorios $(<span style="font-weight: bold; font-style: italic;">DOCS</span>)/Calendario-Econometria-Aplicada.pdf

<span style="font-weight: bold; font-style: italic;">REPO_URL</span> = https://github.com/mbujosab/TimeSeriesData
<span style="font-weight: bold; font-style: italic;">DATOS_DIR</span> = ./datos/
<span style="font-weight: bold; font-style: italic;">TEMP_DIR</span> = ../TimeSeriesData_temp

<span style="font-weight: bold;">copia_datos</span>: $(<span style="font-weight: bold; font-style: italic;">DATOS_DIR</span>)
        <span style="font-weight: bold; text-decoration: underline;">@</span>echo <span style="font-style: italic;">"Clonando el repositorio $(</span><span style="font-weight: bold; font-style: italic;">REPO_URL</span><span style="font-style: italic;">) con profundidad 1..."</span>
        #<span style="font-weight: bold; font-style: italic;"> </span><span style="font-weight: bold; font-style: italic;">1. Clonar el repositorio en un directorio temporal SEGURO
</span>        <span style="font-weight: bold; text-decoration: underline;">@</span>git clone --depth 1 $(<span style="font-weight: bold; font-style: italic;">REPO_URL</span>) $(<span style="font-weight: bold; font-style: italic;">TEMP_DIR</span>)
        <span style="font-weight: bold; text-decoration: underline;">@</span>echo <span style="font-style: italic;">"Copiando archivos y directorios sin la extensi&#243;n .org, .git o .projectile a $(</span><span style="font-weight: bold; font-style: italic;">DATOS_DIR</span><span style="font-style: italic;">) (manteniendo estructura)..."</span>
        #<span style="font-weight: bold; font-style: italic;"> </span><span style="font-weight: bold; font-style: italic;">2. **CR&#205;TICO:** Bloque condicional de rsync con exclusiones mejoradas
</span>        <span style="font-weight: bold; text-decoration: underline;">@</span>if [ -d <span style="font-style: italic;">"$(</span><span style="font-weight: bold; font-style: italic;">TEMP_DIR</span><span style="font-style: italic;">)"</span> ]; then \
                rsync -av \
                        --exclude <span style="font-style: italic;">'*/.git*'</span> \
                        --exclude <span style="font-style: italic;">'*.org'</span> \
                        --exclude <span style="font-style: italic;">'.*'</span> \
                        --include <span style="font-style: italic;">'*/'</span> \
                        --include <span style="font-style: italic;">'*'</span> \
                        <span style="font-style: italic;">"$(</span><span style="font-weight: bold; font-style: italic;">TEMP_DIR</span><span style="font-style: italic;">)/"</span> <span style="font-style: italic;">"$(</span><span style="font-weight: bold; font-style: italic;">DATOS_DIR</span><span style="font-style: italic;">)"</span>; \
        else \
                echo <span style="font-style: italic;">"ERROR: Fall&#243; la clonaci&#243;n. Directorio fuente ($(</span><span style="font-weight: bold; font-style: italic;">TEMP_DIR</span><span style="font-style: italic;">)) no encontrado. NO se copi&#243; nada."</span> 1&gt;&amp;2; \
        fi
        <span style="font-weight: bold; text-decoration: underline;">@</span>echo <span style="font-style: italic;">"Limpiando directorio temporal..."</span>
        #<span style="font-weight: bold; font-style: italic;"> </span><span style="font-weight: bold; font-style: italic;">3. Eliminar el directorio temporal clonado
</span>        <span style="font-weight: bold; text-decoration: underline;">@</span>rm -rf <span style="font-style: italic;">"$(</span><span style="font-weight: bold; font-style: italic;">TEMP_DIR</span><span style="font-style: italic;">)"</span>
        <span style="font-weight: bold; text-decoration: underline;">@</span>echo <span style="font-style: italic;">"Copia de archivos y estructura completada."</span>

<span style="font-weight: bold;">$(</span><span style="font-weight: bold; font-style: italic;">DATOS_DIR</span><span style="font-weight: bold;">)</span>:
        <span style="font-weight: bold; text-decoration: underline;">@</span>mkdir -p $(<span style="font-weight: bold; font-style: italic;">DATOS_DIR</span>)


<span style="font-weight: bold;">$(</span><span style="font-weight: bold; font-style: italic;">DOCS</span><span style="font-weight: bold;">)/Calendario-Econometria-Aplicada.pdf</span>:
        emacs --batch Calendario/README.org -l org -f org-babel-tangle
        cd Calendario &amp;&amp; make Calendario-Econometria-Aplicada.pdf

<span style="font-weight: bold;">publicacion</span>:
        cp -a README.org  $(<span style="font-weight: bold; font-style: italic;">DOCS</span>)
        mkdir -p $(<span style="font-weight: bold; font-style: italic;">DOCS</span>)/Practicas-html/img
        find . -wholename $(<span style="font-weight: bold; font-style: italic;">LECCIONES_tmp</span>)/P-L*.pdf -exec cp {} $(<span style="font-weight: bold; font-style: italic;">DOCS</span>)/Practicas-pdf/ \;
        find . -wholename $(<span style="font-weight: bold; font-style: italic;">LECCIONES_tmp</span>)/P-L*.html -exec cp {} $(<span style="font-weight: bold; font-style: italic;">DOCS</span>)/Practicas-html/ \;
        cp -a $(<span style="font-weight: bold; font-style: italic;">DOCS</span>)/Lecciones-html/img/P-L* $(<span style="font-weight: bold; font-style: italic;">DOCS</span>)/Practicas-html/img/
        cp -a $(<span style="font-weight: bold; font-style: italic;">DOCS</span>)/Lecciones-html/P-L*.html $(<span style="font-weight: bold; font-style: italic;">DOCS</span>)/Practicas-html/
<span style="font-weight: bold; font-style: italic;">#       </span><span style="font-weight: bold; font-style: italic;">find $(</span><span style="font-weight: bold; font-style: italic;">DOCS</span><span style="font-weight: bold; font-style: italic;">)/Lecciones-html/img/ -maxdepth 1 -type d -name "P-L*" -exec cp -a {}  $(</span><span style="font-weight: bold; font-style: italic;">DOCS</span><span style="font-weight: bold; font-style: italic;">)/Practicas-html/img/ \;
</span><span style="font-weight: bold; font-style: italic;">#       </span><span style="font-weight: bold; font-style: italic;">find $(</span><span style="font-weight: bold; font-style: italic;">DOCS</span><span style="font-weight: bold; font-style: italic;">)
</span>

<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Defino las rutas de origen y destino para mayor claridad
</span><span style="font-weight: bold; font-style: italic;">SRC_IMG</span> = $(<span style="font-weight: bold; font-style: italic;">DOCS</span>)/Lecciones-html/img/ 
<span style="font-weight: bold; font-style: italic;">DST_IMG</span> = $(<span style="font-weight: bold; font-style: italic;">DOCS</span>)/Practicas-html/img/

<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Para crear los enlaces simb&#243;licos de las pr&#225;cticas en Python
</span><span style="font-weight: bold;">img_symlink_files</span>:
        <span style="font-weight: bold; font-style: italic;">files</span>=$(<span style="font-weight: bold; font-style: italic;">shell</span> find $(<span style="font-weight: bold; font-style: italic;">SRC_IMG</span>) -name *.png); \
        for file in $$files; do \
                if [ -e <span style="font-style: italic;">"$$file"</span> ]; then \
                        <span style="font-weight: bold; font-style: italic;">base_name</span>=$$(basename <span style="font-style: italic;">"$$file"</span> .png); \
                        echo <span style="font-style: italic;">"Procesando archivo: $$file"</span>; \
                        ln -snf ../$$file <span style="font-style: italic;">"$(</span><span style="font-weight: bold; font-style: italic;">DST_IMG</span><span style="font-style: italic;">)$$base_name.png"</span>; \
                        echo <span style="font-style: italic;">"Enlace creado: $(</span><span style="font-weight: bold; font-style: italic;">DST_IMG</span><span style="font-style: italic;">)$$base_name.png -&gt; ../$$file"</span>; \
                else \
                        echo <span style="font-style: italic;">"Archivo: $$file no existe"</span>; \
                fi; \
        done


<span style="font-weight: bold;">publicacion-lecciones</span>: $(<span style="font-weight: bold; font-style: italic;">patsubst</span> $(<span style="font-weight: bold; font-style: italic;">LECCIONES_SRC</span>)/%.org,$(<span style="font-weight: bold; font-style: italic;">CUADERNOS</span>)/%.ipynb,$(<span style="font-weight: bold; font-style: italic;">wildcard</span> $(<span style="font-weight: bold; font-style: italic;">SRC_FILES</span>))) README.org index.org
        echo <span style="font-style: italic;">"FICHEROS EN CuadernosElectronicos y Transparencias?..."</span>
        cp -a $(<span style="font-weight: bold; font-style: italic;">LECCIONES_tmp</span>)/Lecc*.slides.html $(<span style="font-weight: bold; font-style: italic;">TRANSPARENCIAS</span>)
        find . -wholename $(<span style="font-weight: bold; font-style: italic;">LECCIONES_tmp</span>)/P-L*.slides.html -exec cp {} $(<span style="font-weight: bold; font-style: italic;">TRANSPARENCIAS</span>)/ \;
<span style="font-weight: bold; font-style: italic;">#       </span><span style="font-weight: bold; font-style: italic;">#cp -a $(</span><span style="font-weight: bold; font-style: italic;">LECCIONES_tmp</span><span style="font-weight: bold; font-style: italic;">)/P-L*.slides.html $(</span><span style="font-weight: bold; font-style: italic;">TRANSPARENCIAS</span><span style="font-weight: bold; font-style: italic;">)
</span>        ls $(<span style="font-weight: bold; font-style: italic;">CUADERNOS</span>)
        ls $(<span style="font-weight: bold; font-style: italic;">TRANSPARENCIAS</span>)
        echo <span style="font-style: italic;">"EJECUCI&#211;N DE publica.el..."</span>
        emacs --batch \
          --load ~/Software/scimax/init.el \
          -l publica.el
        touch <span style="font-weight: bold;">$</span><span style="font-weight: bold; text-decoration: underline;">@</span>
<span style="font-weight: bold; font-style: italic;">#       </span><span style="font-weight: bold; font-style: italic;">echo "FICHEROS EN Docs?..."
</span><span style="font-weight: bold; font-style: italic;">#       </span><span style="font-weight: bold; font-style: italic;">find $(</span><span style="font-weight: bold; font-style: italic;">DOCS</span><span style="font-weight: bold; font-style: italic;">)/Lecciones-html
</span><span style="font-weight: bold; font-style: italic;">#       </span><span style="font-weight: bold; font-style: italic;">find $(</span><span style="font-weight: bold; font-style: italic;">DOCS</span><span style="font-weight: bold; font-style: italic;">)/Lecciones-pdf
</span>
<span style="font-weight: bold;">publicacion-practicas</span>: $(<span style="font-weight: bold; font-style: italic;">patsubst</span> $(<span style="font-weight: bold; font-style: italic;">PRACTICAS_SRC</span>)/%.org,$(<span style="font-weight: bold; font-style: italic;">CUADERNOS</span>)/%.ipynb,$(<span style="font-weight: bold; font-style: italic;">wildcard</span> $(<span style="font-weight: bold; font-style: italic;">SRC_FILES</span>))) README.org index.org
        echo <span style="font-style: italic;">"EJECUCI&#211;N DE publica-practicas.el..."</span>
        emacs --batch \
          --load ~/Software/scimax/init.el \
          -l publica-practicas.el
        echo <span style="font-style: italic;">"FICHEROS EN Docs?..."</span>
        touch <span style="font-weight: bold;">$</span><span style="font-weight: bold; text-decoration: underline;">@</span>
<span style="font-weight: bold; font-style: italic;">#       </span><span style="font-weight: bold; font-style: italic;">find $(</span><span style="font-weight: bold; font-style: italic;">DOCS</span><span style="font-weight: bold; font-style: italic;">)/Practicas-html
</span><span style="font-weight: bold; font-style: italic;">#       </span><span style="font-weight: bold; font-style: italic;">find $(</span><span style="font-weight: bold; font-style: italic;">DOCS</span><span style="font-weight: bold; font-style: italic;">)/Practicas-pdf
</span>

<span style="font-weight: bold;">notebooksYslides</span>: $(<span style="font-weight: bold; font-style: italic;">patsubst</span> $(<span style="font-weight: bold; font-style: italic;">LECCIONES_SRC</span>)/%.org,$(<span style="font-weight: bold; font-style: italic;">CUADERNOS</span>)/%.ipynb,$(<span style="font-weight: bold; font-style: italic;">wildcard</span> $(<span style="font-weight: bold; font-style: italic;">SRC_FILES</span>)))
        touch <span style="font-weight: bold;">$</span><span style="font-weight: bold; text-decoration: underline;">@</span>
<span style="font-weight: bold; font-style: italic;">#       </span><span style="font-weight: bold; font-style: italic;">pkill -f "python3 -m ipykernel_launcher"
</span>
<span style="font-weight: bold;">$(</span><span style="font-weight: bold; font-style: italic;">CUADERNOS</span><span style="font-weight: bold;">)/%.ipynb $(</span><span style="font-weight: bold; font-style: italic;">TRANSPARENCIAS</span><span style="font-weight: bold;">)/%.slides.html</span>: $(<span style="font-weight: bold; font-style: italic;">LECCIONES_SRC</span>)/%.org
        make directorios
        make programas_de_python
<span style="font-weight: bold; font-style: italic;">#       </span><span style="font-weight: bold; font-style: italic;">make symlink_files
</span>        cp -a $(<span style="font-weight: bold; font-style: italic;">LECCIONES_SRC</span>)/*.bib $(<span style="font-weight: bold; font-style: italic;">LECCIONES_tmp</span>)
        cp -a $<span style="font-weight: bold; text-decoration: underline;">&lt;</span> $(<span style="font-weight: bold; font-style: italic;">LECCIONES_tmp</span>)
        echo <span style="font-style: italic;">"EJECUCION DEL NOTEBOOK DE ORG: $(</span><span style="font-weight: bold; font-style: italic;">LECCIONES_tmp</span><span style="font-style: italic;">)/$(</span><span style="font-weight: bold; font-style: italic;">@F</span><span style="font-style: italic;">:.ipynb=.org)..."</span>
        emacs -Q -l ~/Software/scimax/init.el $(<span style="font-weight: bold; font-style: italic;">LECCIONES_tmp</span>)/$(<span style="font-weight: bold; font-style: italic;">@F</span>:<span style="font-weight: bold; font-style: italic;">.ipynb</span>=.org) --batch --eval <span style="font-style: italic;">"(org-babel-execute-buffer)"</span> --eval <span style="font-style: italic;">"(save-buffer)"</span> --kill
        cp -a $(<span style="font-weight: bold; font-style: italic;">LECCIONES_tmp</span>)/$(<span style="font-weight: bold; font-style: italic;">@F</span>) $(<span style="font-weight: bold; font-style: italic;">CUADERNOS</span>)
        echo <span style="font-style: italic;">"EJECUCION DEL NOTEBOOK DE JUPYTER..."</span>
        jupyter nbconvert --execute --inplace $(<span style="font-weight: bold; font-style: italic;">LECCIONES_tmp</span>)/$(<span style="font-weight: bold; font-style: italic;">@F</span>) 
        echo <span style="font-style: italic;">"FICHEROS EN ./lecciones?..."</span>
<span style="font-weight: bold; font-style: italic;">#       </span><span style="font-weight: bold; font-style: italic;">find $(</span><span style="font-weight: bold; font-style: italic;">LECCIONES_tmp</span><span style="font-weight: bold; font-style: italic;">)
</span>        echo <span style="font-style: italic;">"FICHEROS EN ./docs/Lecciones-html/img?..."</span>
        cp -a $(<span style="font-weight: bold; font-style: italic;">LECCIONES_tmp</span>)/img $(<span style="font-weight: bold; font-style: italic;">DOCS</span>)/Lecciones-html
<span style="font-weight: bold; font-style: italic;">#       </span><span style="font-weight: bold; font-style: italic;">find $(</span><span style="font-weight: bold; font-style: italic;">DOCS</span><span style="font-weight: bold; font-style: italic;">)/Lecciones-html/img
</span>        echo <span style="font-style: italic;">"Contenido de img tras notebook:"</span>
<span style="font-weight: bold; font-style: italic;">#       </span><span style="font-weight: bold; font-style: italic;">find $(</span><span style="font-weight: bold; font-style: italic;">LECCIONES_tmp</span><span style="font-weight: bold; font-style: italic;">)/img
</span>        echo <span style="font-style: italic;">"COPIO LO QUE SE HA GENERADO (.ipynb sin ejecutar y las im&#225;genes) A ./docs..."</span>
        ln -snf -r $(<span style="font-weight: bold; font-style: italic;">DOCS</span>)/Lecciones-html/img/ $(<span style="font-weight: bold; font-style: italic;">TRANSPARENCIAS</span>)/
        ln -snf -r $(<span style="font-weight: bold; font-style: italic;">DOCS</span>)/Lecciones-html/img/ $(<span style="font-weight: bold; font-style: italic;">CUADERNOS</span>)/
<span style="font-weight: bold; font-style: italic;">#       </span><span style="font-weight: bold; font-style: italic;"># Ejecutar el notebook con jupyter nbconvert
</span>        echo <span style="font-style: italic;">"CREACI&#211;N DE LAS SLIDES..."</span>
        jupyter nbconvert --config mycfg-GitHubPages.py --to slides --reveal-prefix <span style="font-style: italic;">"https://unpkg.com/reveal.js@5.2.1"</span> --execute $(<span style="font-weight: bold; font-style: italic;">LECCIONES_tmp</span>)/$(<span style="font-weight: bold; font-style: italic;">@F</span>) 
        echo <span style="font-style: italic;">"&#10145;&#65039; FICHEROS EN docs/ TRAS GENERAR SLIDES Y NOTEBOOKS DE JUPYTER..."</span>
<span style="font-weight: bold; font-style: italic;">#       </span><span style="font-weight: bold; font-style: italic;">find $(</span><span style="font-weight: bold; font-style: italic;">DOCS</span><span style="font-weight: bold; font-style: italic;">)
</span>


<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Define las rutas de origen y destino para mayor claridad
</span><span style="font-weight: bold; font-style: italic;">SRC_DIR_PRACTICAS</span> =./org-practicas/     <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">./org-practicas/
</span><span style="font-weight: bold; font-style: italic;">DST_DIR_PRACTICAS</span> =./org-lessons/

<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Para crear los enlaces simb&#243;licos de las pr&#225;cticas en Python
</span><span style="font-weight: bold;">symlink_files</span>:
        <span style="font-weight: bold; font-style: italic;">files</span>=$(<span style="font-weight: bold; font-style: italic;">shell</span> find $(<span style="font-weight: bold; font-style: italic;">SRC_DIR_PRACTICAS</span>) -name *.txt); \
        for file in $$files; do \
                if [ -e <span style="font-style: italic;">"$$file"</span> ]; then \
                        <span style="font-weight: bold; font-style: italic;">base_name</span>=$$(basename <span style="font-style: italic;">"$$file"</span> .txt); \
                        echo <span style="font-style: italic;">"Procesando archivo: $$file"</span>; \
                        ln -snf ../$$file <span style="font-style: italic;">"$(</span><span style="font-weight: bold; font-style: italic;">DST_DIR_PRACTICAS</span><span style="font-style: italic;">)$$base_name.org"</span>; \
                        echo <span style="font-style: italic;">"Enlace creado: $(</span><span style="font-weight: bold; font-style: italic;">DST_DIR_PRACTICAS</span><span style="font-style: italic;">)$$base_name.org -&gt; ../$$file"</span>; \
                else \
                        echo <span style="font-style: italic;">"Archivo: $$file no existe"</span>; \
                fi; \
        done



<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Lista de archivos fuente .org en org-practicas
</span><span style="font-weight: bold; font-style: italic;">PRACTICAS_SRC</span> = $(<span style="font-weight: bold; font-style: italic;">wildcard</span> org-practicas/*.org)

<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Ficheros .done como se&#241;al de que fueron tanglados
</span><span style="font-weight: bold; font-style: italic;">PRACTICAS_DONE</span> = $(<span style="font-weight: bold; font-style: italic;">patsubst</span> org-practicas/%.org, $(<span style="font-weight: bold; font-style: italic;">PRACTICAS_tmp</span>)/%.done, $(<span style="font-weight: bold; font-style: italic;">PRACTICAS_SRC</span>))

<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Objetivo principal de las pr&#225;cticas en Gretl
</span><span style="font-weight: bold;">practicas</span>: figuras_de_lecciones $(<span style="font-weight: bold; font-style: italic;">PRACTICAS_DONE</span>)
        <span style="font-weight: bold; text-decoration: underline;">@</span>echo <span style="font-style: italic;">"&#9989; Todas las pr&#225;cticas actualizadas."</span>

<span style="font-weight: bold;">$(</span><span style="font-weight: bold; font-style: italic;">PRACTICAS_tmp</span><span style="font-weight: bold;">)/%.done</span>: org-practicas/%.org
        echo <span style="font-style: italic;">"&#10145;&#65039; Copiando y ejecutando $</span><span style="font-weight: bold; font-style: italic; text-decoration: underline;">&lt;</span><span style="font-style: italic;"> ..."</span>
        mkdir -p $(<span style="font-weight: bold; font-style: italic;">PRACTICAS_tmp</span>)/guiones
        cp $<span style="font-weight: bold; text-decoration: underline;">&lt;</span> $(<span style="font-weight: bold; font-style: italic;">PRACTICAS_tmp</span>)/
        mkdir -p $(<span style="font-weight: bold; font-style: italic;">PRACTICAS_tmp</span>)/src
        cp $(<span style="font-weight: bold; font-style: italic;">LECCIONES_tmp</span>)/src/*.py $(<span style="font-weight: bold; font-style: italic;">PRACTICAS_tmp</span>)/src
        ln -snf -r $(<span style="font-weight: bold; font-style: italic;">LECCIONES_tmp</span>)/datos $(<span style="font-weight: bold; font-style: italic;">PRACTICAS_tmp</span>)/
        cp -a org-practicas/hansl.tex $(<span style="font-weight: bold; font-style: italic;">PRACTICAS_tmp</span>)/
        echo <span style="font-style: italic;">"&#129504; Ejecutando org-babel-tangle y eval..."</span>
        set -e; \
        if emacs --batch \
          --load ~/Software/scimax/init.el \
          $(<span style="font-weight: bold; font-style: italic;">PRACTICAS_tmp</span>)/<span style="font-weight: bold;">$</span><span style="font-weight: bold; text-decoration: underline;">*</span>.org \
          --eval <span style="font-style: italic;">"(org-babel-execute-buffer)"</span> \
          --eval <span style="font-style: italic;">"(save-buffer)"</span> \
          --kill; then \
            echo <span style="font-style: italic;">"&#9989; Correcto: $</span><span style="font-weight: bold; font-style: italic; text-decoration: underline;">&lt;</span><span style="font-style: italic;">"</span>; \
            touch <span style="font-weight: bold;">$</span><span style="font-weight: bold; text-decoration: underline;">@</span>; \
        else \
            echo <span style="font-style: italic;">"&#10060; Error al procesar $</span><span style="font-weight: bold; font-style: italic; text-decoration: underline;">&lt;</span><span style="font-style: italic;">"</span>; \
            rm -f <span style="font-weight: bold;">$</span><span style="font-weight: bold; text-decoration: underline;">@</span>; \
            exit 1; \
        fi
        echo <span style="font-style: italic;">"&#10145;&#65039; listado de ficheros en el subdirectorio guiones"</span>
        ls -lR $(<span style="font-weight: bold; font-style: italic;">PRACTICAS_tmp</span>)/guiones  <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Debug para Actions
</span>
<span style="font-weight: bold;">figuras_de_lecciones</span>:
        cp -a $(<span style="font-weight: bold; font-style: italic;">LECCIONES_tmp</span>)/img/lecc04/MA2roots.png $(<span style="font-weight: bold; font-style: italic;">PRACTICAS_tmp</span>)/img/
        cp -a $(<span style="font-weight: bold; font-style: italic;">LECCIONES_tmp</span>)/img/lecc04/ACF-MA1p.png $(<span style="font-weight: bold; font-style: italic;">PRACTICAS_tmp</span>)/img/
        cp -a $(<span style="font-weight: bold; font-style: italic;">LECCIONES_tmp</span>)/img/lecc05/ACF-AR1p.png $(<span style="font-weight: bold; font-style: italic;">PRACTICAS_tmp</span>)/img/
        cp -a $(<span style="font-weight: bold; font-style: italic;">LECCIONES_tmp</span>)/img/lecc05/AR2roots.png $(<span style="font-weight: bold; font-style: italic;">PRACTICAS_tmp</span>)/img/
        cp -a $(<span style="font-weight: bold; font-style: italic;">LECCIONES_tmp</span>)/img/lecc03/IBEX35.png   $(<span style="font-weight: bold; font-style: italic;">PRACTICAS_tmp</span>)/img/
        cp -a $(<span style="font-weight: bold; font-style: italic;">LECCIONES_tmp</span>)/img/lecc07/ACF-RW.png   $(<span style="font-weight: bold; font-style: italic;">PRACTICAS_tmp</span>)/img/

<span style="font-weight: bold; font-style: italic;">ORG_FILES</span> := $(<span style="font-weight: bold; font-style: italic;">wildcard</span> $(<span style="font-weight: bold; font-style: italic;">LECCIONES_SRC</span>)/src/*.org)
<span style="font-weight: bold; font-style: italic;">TMP_FILES</span> := $(<span style="font-weight: bold; font-style: italic;">patsubst</span> $(<span style="font-weight: bold; font-style: italic;">LECCIONES_SRC</span>)/src/%.org, $(<span style="font-weight: bold; font-style: italic;">LECCIONES_tmp</span>)/src/%.org, $(<span style="font-weight: bold; font-style: italic;">ORG_FILES</span>))

<span style="font-weight: bold;">programas_de_python</span>: $(<span style="font-weight: bold; font-style: italic;">TMP_FILES</span>)

<span style="font-weight: bold;">$(</span><span style="font-weight: bold; font-style: italic;">LECCIONES_tmp</span><span style="font-weight: bold;">)/src/%.org</span>: $(<span style="font-weight: bold; font-style: italic;">LECCIONES_SRC</span>)/src/%.org
        echo <span style="font-style: italic;">"INICIO </span><span style="font-weight: bold; font-style: italic;">$</span><span style="font-weight: bold; font-style: italic; text-decoration: underline;">*</span><span style="font-style: italic;">.ipynb..."</span>
        make directorios
        cp $<span style="font-weight: bold; text-decoration: underline;">&lt;</span> $(<span style="font-weight: bold; font-style: italic;">LECCIONES_tmp</span>)/src/
        emacs -q --batch $(<span style="font-weight: bold; font-style: italic;">LECCIONES_tmp</span>)/src/<span style="font-weight: bold;">$</span><span style="font-weight: bold; text-decoration: underline;">*</span>.org -l org -f org-babel-tangle
        cp -a $(<span style="font-weight: bold; font-style: italic;">LECCIONES_tmp</span>)/src/<span style="font-weight: bold;">$</span><span style="font-weight: bold; text-decoration: underline;">*</span>.py $(<span style="font-weight: bold; font-style: italic;">CUADERNOS</span>)/src/
        ln -sf -r $(<span style="font-weight: bold; font-style: italic;">CUADERNOS</span>)/src/<span style="font-weight: bold;">$</span><span style="font-weight: bold; text-decoration: underline;">*</span>.py $(<span style="font-weight: bold; font-style: italic;">CUADERNOS</span>)/
        emacs -Q -l ~/Software/scimax/init.el $(<span style="font-weight: bold; font-style: italic;">LECCIONES_tmp</span>)/$(<span style="font-weight: bold; font-style: italic;">@F</span>:<span style="font-weight: bold; font-style: italic;">.ipynb</span>=.org) --batch --eval <span style="font-style: italic;">"(org-babel-execute-buffer)"</span> --eval <span style="font-style: italic;">"(save-buffer)"</span> --kill
        emacs -q --batch \
          --load ~/Software/scimax/init.el \
          --eval <span style="font-style: italic;">"(require 'ox-ipynb)"</span> \
          --eval <span style="font-style: italic;">"(ox-ipynb-export-org-file-to-ipynb-file \"$(</span><span style="font-weight: bold; font-style: italic;">LECCIONES_tmp</span><span style="font-style: italic;">)/src/</span><span style="font-weight: bold; font-style: italic;">$</span><span style="font-weight: bold; font-style: italic; text-decoration: underline;">*</span><span style="font-style: italic;">.org\")"</span>
        jupyter nbconvert --execute --inplace $(<span style="font-weight: bold; font-style: italic;">LECCIONES_tmp</span>)/src/<span style="font-weight: bold;">$</span><span style="font-weight: bold; text-decoration: underline;">*</span>.ipynb
        jupyter nbconvert --config mycfg-GitHubPages.py --to slides --reveal-prefix <span style="font-style: italic;">"https://unpkg.com/reveal.js@5.2.1"</span> --execute $(<span style="font-weight: bold; font-style: italic;">LECCIONES_tmp</span>)/src/<span style="font-weight: bold;">$</span><span style="font-weight: bold; text-decoration: underline;">*</span>.ipynb
        jupyter nbconvert --execute --to html $(<span style="font-weight: bold; font-style: italic;">LECCIONES_tmp</span>)/src/<span style="font-weight: bold;">$</span><span style="font-weight: bold; text-decoration: underline;">*</span>.ipynb
        cp -a $(<span style="font-weight: bold; font-style: italic;">LECCIONES_tmp</span>)/src/<span style="font-weight: bold;">$</span><span style="font-weight: bold; text-decoration: underline;">*</span>.ipynb $(<span style="font-weight: bold; font-style: italic;">CUADERNOS</span>)
        cp -a $(<span style="font-weight: bold; font-style: italic;">LECCIONES_tmp</span>)/src/<span style="font-weight: bold;">$</span><span style="font-weight: bold; text-decoration: underline;">*</span>.slides.html $(<span style="font-weight: bold; font-style: italic;">TRANSPARENCIAS</span>)
        cp -a $(<span style="font-weight: bold; font-style: italic;">LECCIONES_tmp</span>)/src/<span style="font-weight: bold;">$</span><span style="font-weight: bold; text-decoration: underline;">*</span>.html $(<span style="font-weight: bold; font-style: italic;">DOCS</span>)/Lecciones-html/src/
        echo <span style="font-style: italic;">"TERMINADO </span><span style="font-weight: bold; font-style: italic;">$</span><span style="font-weight: bold; font-style: italic; text-decoration: underline;">*</span><span style="font-style: italic;">.ipynb..."</span>

<span style="font-weight: bold;">directorios</span>:
        mkdir -v -p .github/workflows
        mkdir -v -p $(<span style="font-weight: bold; font-style: italic;">LECCIONES_tmp</span>)/src
        mkdir -v -p $(<span style="font-weight: bold; font-style: italic;">LECCIONES_tmp</span>)/img
        mkdir -v -p $(<span style="font-weight: bold; font-style: italic;">PRACTICAS_tmp</span>)/img
        mkdir -v -p $(<span style="font-weight: bold; font-style: italic;">DOCS</span>)/Lecciones-pdf
        mkdir -v -p $(<span style="font-weight: bold; font-style: italic;">DOCS</span>)/.binder
        mkdir -v -p $(<span style="font-weight: bold; font-style: italic;">DOCS</span>)/Lecciones-html/img
        mkdir -v -p $(<span style="font-weight: bold; font-style: italic;">DOCS</span>)/Lecciones-html/src
        mkdir -v -p $(<span style="font-weight: bold; font-style: italic;">TRANSPARENCIAS</span>)
        mkdir -v -p $(<span style="font-weight: bold; font-style: italic;">CUADERNOS</span>)/src
        cp -a ./css $(<span style="font-weight: bold; font-style: italic;">LECCIONES_tmp</span>)/
        cp -a ./datos $(<span style="font-weight: bold; font-style: italic;">LECCIONES_tmp</span>)/
        cp -a ./datos $(<span style="font-weight: bold; font-style: italic;">DOCS</span>)/
        cp -a ./org-lessons/00preambulo_lecciones.txt $(<span style="font-weight: bold; font-style: italic;">LECCIONES_tmp</span>)/
        cp -a ./org-practicas/00preambulo_practicas.txt $(<span style="font-weight: bold; font-style: italic;">PRACTICAS_tmp</span>)/
        cp -a ./figurasGretl $(<span style="font-weight: bold; font-style: italic;">LECCIONES_tmp</span>)/img/
        touch directorios

<span style="font-weight: bold;">clean</span>:
        rm -r -f $(<span style="font-weight: bold; font-style: italic;">LECCIONES_tmp</span>)
        rm -r -f $(<span style="font-weight: bold; font-style: italic;">PRACTICAS_tmp</span>)

<span style="font-weight: bold;">cleanAll</span>: clean
        #<span style="font-weight: bold; font-style: italic;">find $(</span><span style="font-weight: bold; font-style: italic;">DOCS</span><span style="font-weight: bold; font-style: italic;">)/ -mindepth 1 ! -name 'README.org' ! -name '.binder' -exec rm -rf {} +
</span>        rm -r -f $(<span style="font-weight: bold; font-style: italic;">DOCS</span>)
        rm -f directorios
        rm -f series_formales
        rm -f publicacion-lecciones
        rm -f publicacion-practicas
        rm -f practicas
        rm -f notebooksYslides
        rm -f sitemap.org
        rm -r -f logs

<span style="font-weight: bold;">limpia_kernels_jupyter</span>:
        pkill -f <span style="font-style: italic;">"python3 -m ipykernel_launcher"</span>
        #<span style="font-weight: bold; font-style: italic;"> </span><span style="font-weight: bold; font-style: italic;">pkill -f "python3 -m ipykernel_launcher -f /home/marcos/.local/share/jupyter/runtime/kernel-.*\.json"
</span>
</code></pre>
</div>
</div>
