org-publish.org
**** tlmgr
Scimax intenta usar ~tlmgr~ para instalar paquetes de $\LaTeX{}$, pero =Actions= de =GitHub= no lo permite. Las medidas tomadas para evitar este problema han sido 
1. Al ejecutarse ~.github/workflows/build.yml~ en GitHub Actions se crea un fichero =~/.emacs.d/no-tlmgr.el= con el siguiente contenido
   #+BEGIN_SRC 
(setq system-packages-use-sudo nil)
(setq TeX-install-font-lock nil)
   #+END_SRC
   así, al publicar los ficheros, podemos llamar a scimax del siguiente modo
   #+BEGIN_SRC 
emacs --batch \
  --load ~/.emacs.d/no-tlmgr.el \
  --load ~/Software/scimax/init.el \
  -l publica.el
   #+END_SRC
2. Además en ~.github/workflows/build.yml~ he añadido
   #+BEGIN_SRC 
    - name: Disable tlmgr (prevent accidental calls)
      run: sudo mv /usr/bin/tlmgr /usr/bin/tlmgr.disabled || true
   #+END_SRC

Quizá sea suficiente solo con esto segundo. Pero si quito el fichero =~/.emacs.d/no-tlmgr.el=, también he de omitirlo en las llamadas a emacs usando scimax (como así funciona... así se queda).

*** Consulta a Copilot sobre la generación de figuras

Tuve dificultades para que la ejecución en GitHub Actions de los de los cuadernos electrónicos de Scimax creara las figuras. A continuación copio mi consulta a copilot: 

#+BEGIN_QUOTE
-----
-----
*/Consulta/*:
/Anteriormente faltaba por instalar el paquete dvipng. Una vez instalado dvipng, el bloque de código/:

#+BEGIN_SRC jupyter-python :results file :exports results
plt.plot([1,2,3],[4,5,6])
plt.savefig("img/prueba_action.png")
"img/prueba_action.png"
#+END_SRC

/ha creado correctamente el fichero "img/prueba_action.png" con la figura. Sin embargo, el bloque/

#+BEGIN_SRC jupyter-python :results file :file ./img/lecc01/PIB_UEM.png
df1.plot(x='obs',xlabel='',figsize=(15,4)).set_title('PIB zona euro',fontsize=18)
#+END_SRC

/no ha creado el fichero ./img/lecc01/PIB_UEM.png con su correspondiente figura./
-----
-----
#+END_QUOTE

¡Excelente que la instalación de dvipng haya solucionado la generación de imágenes para el primer bloque!  
Ahora, pasemos a analizar por qué el segundo bloque *no genera* el archivo `./img/lecc01/PIB_UEM.png`.

-----

**** Diagnóstico y causas probables

***** 1. Diferencia clave entre ambos bloques

- *Bloque que funciona:*

  #+BEGIN_SRC org
  #+BEGIN_SRC jupyter-python :results file :exports results
  plt.plot([1,2,3],[4,5,6])
  plt.savefig("img/prueba_action.png")
  "img/prueba_action.png"
  #+END_SRC
  #+END_SRC

  - Aquí, tú generas la figura y la guardas explícitamente con `plt.savefig()`, y luego devuelves el nombre del archivo en la última línea.

- *Bloque que falla:*

  #+BEGIN_SRC org
  #+BEGIN_SRC jupyter-python :results file :file ./img/lecc01/PIB_UEM.png
  df1.plot(x='obs',xlabel='',figsize=(15,4)).set_title('PIB zona euro',fontsize=18)
  #+END_SRC
  #+END_SRC

  - Aquí confías en que org-babel/jupyter-python guardará automáticamente la figura en `:file`, pero el método pandas `df.plot()` *no guarda ni devuelve* el archivo.

***** 2. ¿Por qué falla el segundo bloque?

- El argumento `:file ./img/lecc01/PIB_UEM.png` espera que el último comando del bloque *guarde la imagen en ese path* (o devuelva una figura que org/jupyter pueda guardar ahí).
- El método `df1.plot(...).set_title(...)` crea y modifica una figura activa, pero *no la guarda*.
- Si usas solo `set_title()`, no hay ninguna instrucción para guardar el gráfico.
- Por defecto, ni org-babel ni jupyter-python pueden adivinar que la figura debe ser guardada en ese path si no se lo indicas de forma explícita.

-----

**** Solución recomendada

*Debes guardar la figura manualmente al path especificado*, y devolver ese path como resultado del bloque.

***** Forma correcta:

#+BEGIN_SRC jupyter-python :results file :file ./img/lecc01/PIB_UEM.png
ax = df1.plot(x='obs', xlabel='', figsize=(15,4))
ax.set_title('PIB zona euro', fontsize=18)
import matplotlib.pyplot as plt
plt.savefig("./img/lecc01/PIB_UEM.png")
"./img/lecc01/PIB_UEM.png"
#+END_SRC

- Esto asegura que la imagen se guarda donde deseas y que el bloque devuelve el path correcto para que org-babel inserte la imagen en el documento.

***** Alternativas

- Si usas solo `:results file` sin `:file`, puedes devolver el nombre del archivo en la última línea.
- Siempre asegúrate de llamar a `plt.savefig()` *después* de crear el gráfico.

-----

**** Resumen

- El bloque con `plt.savefig(...)` funciona porque guarda explícitamente la imagen.
- El bloque con pandas `plot` y solo `set_title()` *NO guarda la imagen*; debes añadir `plt.savefig()` y devolver el path.
- Así, org-babel/jupyter-python incrustará correctamente la imagen en el documento exportado.

-----

#+BEGIN_QUOTE
-----
-----
*/Consulta/*:
/Sin embargo. Cuando ejecuto localmente el fichero org sí se crean las figuras en mi disco. ¿Hay algún modo de que también se creen con Actions sin modificar los bloques? Es decir, ¿hay algún modo de que funcionen tal y como están ahora mismo?/
-----
-----
#+END_QUOTE

¡Esta es una pregunta muy frecuente al usar org-babel/jupyter en entornos CI/CD!  
La diferencia entre tu entorno local y GitHub Actions suele deberse a *la configuración del entorno gráfico* y de *matplotlib*.

-----

**** ¿Por qué funciona localmente pero no en Actions?

- *Localmente*, matplotlib tiene acceso a un entorno gráfico (X11, Wayland, etc.) y suele usar un backend como `TkAgg`, `Qt5Agg`,…
- *En GitHub Actions* (o cualquier entorno headless), *matplotlib no tiene acceso a un display* y por defecto puede intentar usar un backend que requiere uno, lo que impide guardar imágenes.

***** Backend headless necesario

Para guardar imágenes sin display, *matplotlib debe usar un backend como "Agg"*.

-----

**** Solución: Forzar el backend "Agg" para matplotlib

Esto se puede hacer *sin modificar los bloques* añadiendo una configuración previa en tu flujo de trabajo o al comienzo de la ejecución.

***** Opción 1: Variable de entorno en el workflow

Añade esto antes de ejecutar Emacs en tu `build.yml`:

#+BEGIN_SRC yaml
- name: Set MPLBACKEND (matplotlib)
  run: echo "MPLBACKEND=Agg" >> $GITHUB_ENV
#+END_SRC

Matplotlib detectará esto y usará el backend adecuado.

