org-publish.html
<div id="outline-container-orged6d0fc" class="outline-3">
<h3 id="orged6d0fc">Aclaraciones</h3>
<div class="outline-text-3" id="text-orged6d0fc">
</div>
<ul class="org-ul">
<li><a id="org804fd6a"></a>tlmgr<br />
<div class="outline-text-5" id="text-org804fd6a">
<p>
Scimax intenta usar <code>tlmgr</code> para instalar paquetes de \(\LaTeX{}\), pero <code>Actions</code> de <code>GitHub</code> no lo permite. Las medidas tomadas para evitar este problema han sido 
</p>
<ol class="org-ol">
<li><p>
Al ejecutarse <code>.github/workflows/build.yml</code> en GitHub Actions se crea un fichero <code>~/.emacs.d/no-tlmgr.el</code> con el siguiente contenido
</p>
<div class="org-src-container">
<pre class="src src-nil"><code>(setq system-packages-use-sudo nil)
(setq TeX-install-font-lock nil)
</code></pre>
</div>
<p>
así, al publicar los ficheros, podemos llamar a scimax del siguiente modo
</p>
<div class="org-src-container">
<pre class="src src-nil"><code>emacs --batch \
  --load ~/.emacs.d/no-tlmgr.el \
  --load ~/Software/scimax/init.el \
  -l publica.el
</code></pre>
</div></li>
<li><p>
Además en <code>.github/workflows/build.yml</code> he añadido
</p>
<div class="org-src-container">
<pre class="src src-nil"><code>    - name: Disable tlmgr (prevent accidental calls)
      run: sudo mv /usr/bin/tlmgr /usr/bin/tlmgr.disabled || true
</code></pre>
</div></li>
</ol>

<p>
Quizá sea suficiente solo con esto segundo. Pero si quito el fichero <code>~/.emacs.d/no-tlmgr.el</code>, también he de omitirlo en las llamadas a emacs usando scimax (como así funciona&hellip; así se queda).
</p>
</div>
</li>
</ul>
<div id="outline-container-org237dad2" class="outline-4">
<h4 id="org237dad2">Consulta a Copilot sobre la generación de figuras</h4>
<div class="outline-text-4" id="text-org237dad2">
<p>
Tuve dificultades para que la ejecución en GitHub Actions de los de los cuadernos electrónicos de Scimax creara las figuras. A continuación copio mi consulta a copilot: 
</p>

<blockquote>
<hr />
<hr />
<p>
<b><i>Consulta</i></b>:
<i>Anteriormente faltaba por instalar el paquete dvipng. Una vez instalado dvipng, el bloque de código</i>:
</p>

<p>
<i>ha creado correctamente el fichero "img/prueba_action.png" con la figura. Sin embargo, el bloque</i>
</p>

<div class="org-src-container">
<pre class="src src-jupyter-python"><code>df1.plot(x=<span style="font-style: italic;">'obs'</span>,xlabel=<span style="font-style: italic;">''</span>,figsize=(15,4)).set_title(<span style="font-style: italic;">'PIB zona euro'</span>,fontsize=18)
</code></pre>
</div>

<p>
<i>no ha creado el fichero ./img/lecc01/PIB_UEM.png con su correspondiente figura.</i>
</p>
<hr />
<hr />
</blockquote>

<p>
¡Excelente que la instalación de dvipng haya solucionado la generación de imágenes para el primer bloque!  
Ahora, pasemos a analizar por qué el segundo bloque <b>no genera</b> el archivo `./img/lecc01/PIB_UEM.png`.
</p>

<hr />
</div>
<ul class="org-ul">
<li><a id="org752805d"></a>Diagnóstico y causas probables<br />
<ul class="org-ul">
<li><a id="orgd4ca55c"></a>1. Diferencia clave entre ambos bloques<br />
<div class="outline-text-6" id="text-orgd4ca55c">
<ul class="org-ul">
<li><p>
<b>Bloque que funciona:</b>
</p>

<div class="org-src-container">
<pre class="src src-org"><code>  #+BEGIN<span style="color: #0000ff; text-decoration: underline;">_SRC</span> jupyter-python :results file :exports results
  plt.plot([1,2,3],[4,5,6])
  plt.savefig("img/prueba<span style="color: #0000ff; text-decoration: underline;">_action.png</span>")
  "img/prueba<span style="color: #0000ff; text-decoration: underline;">_action.png</span>"
</code></pre>
</div>
<p>
#+END_SRC
</p>

<ul class="org-ul">
<li>Aquí, tú generas la figura y la guardas explícitamente con `plt.savefig()`, y luego devuelves el nombre del archivo en la última línea.</li>
</ul></li>

<li><p>
<b>Bloque que falla:</b>
</p>

<div class="org-src-container">
<pre class="src src-org"><code>  #+BEGIN<span style="color: #0000ff; text-decoration: underline;">_SRC</span> jupyter-python :results file :file ./img/lecc01/PIB<span style="color: #0000ff; text-decoration: underline;">_UEM.png</span>
  df1.plot(x='obs',xlabel='',figsize=(15,4)).set<span style="color: #0000ff; text-decoration: underline;">_title</span>('PIB zona euro',fontsize=18)
</code></pre>
</div>
<p>
#+END_SRC
</p>

<ul class="org-ul">
<li>Aquí confías en que org-babel/jupyter-python guardará automáticamente la figura en `:file`, pero el método pandas `df.plot()` <b>no guarda ni devuelve</b> el archivo.</li>
</ul></li>
</ul>
</div>
</li>
<li><a id="org0ea214f"></a>2. ¿Por qué falla el segundo bloque?<br />
<div class="outline-text-6" id="text-org0ea214f">
<ul class="org-ul">
<li>El argumento `:file ./img/lecc01/PIB_UEM.png` espera que el último comando del bloque <b>guarde la imagen en ese path</b> (o devuelva una figura que org/jupyter pueda guardar ahí).</li>
<li>El método `df1.plot(&hellip;).set_title(&hellip;)` crea y modifica una figura activa, pero <b>no la guarda</b>.</li>
<li>Si usas solo `set_title()`, no hay ninguna instrucción para guardar el gráfico.</li>
<li>Por defecto, ni org-babel ni jupyter-python pueden adivinar que la figura debe ser guardada en ese path si no se lo indicas de forma explícita.</li>
</ul>

<hr />
</div>
</li>
</ul>
</li>
<li><a id="org4695764"></a>Solución recomendada<br />
<div class="outline-text-5" id="text-org4695764">
<p>
<b>Debes guardar la figura manualmente al path especificado</b>, y devolver ese path como resultado del bloque.
</p>
</div>
<ul class="org-ul">
<li><a id="org9bff89e"></a>Forma correcta:<br />
<div class="outline-text-6" id="text-org9bff89e">
<div class="org-src-container">
<pre class="src src-jupyter-python"><code><span style="font-weight: bold; font-style: italic;">ax</span> = df1.plot(x=<span style="font-style: italic;">'obs'</span>, xlabel=<span style="font-style: italic;">''</span>, figsize=(15,4))
ax.set_title(<span style="font-style: italic;">'PIB zona euro'</span>, fontsize=18)
<span style="font-weight: bold;">import</span> matplotlib.pyplot <span style="font-weight: bold;">as</span> plt
plt.savefig(<span style="font-style: italic;">"./img/lecc01/PIB_UEM.png"</span>)
<span style="font-style: italic;">"./img/lecc01/PIB_UEM.png"</span>
</code></pre>
</div>

<ul class="org-ul">
<li>Esto asegura que la imagen se guarda donde deseas y que el bloque devuelve el path correcto para que org-babel inserte la imagen en el documento.</li>
</ul>
</div>
</li>
<li><a id="orgd64b231"></a>Alternativas<br />
<div class="outline-text-6" id="text-orgd64b231">
<ul class="org-ul">
<li>Si usas solo `:results file` sin `:file`, puedes devolver el nombre del archivo en la última línea.</li>
<li>Siempre asegúrate de llamar a `plt.savefig()` <b>después</b> de crear el gráfico.</li>
</ul>

<hr />
</div>
</li>
</ul>
</li>
<li><a id="org54aead1"></a>Resumen<br />
<div class="outline-text-5" id="text-org54aead1">
<ul class="org-ul">
<li>El bloque con `plt.savefig(&hellip;)` funciona porque guarda explícitamente la imagen.</li>
<li>El bloque con pandas `plot` y solo `set_title()` <b>NO guarda la imagen</b>; debes añadir `plt.savefig()` y devolver el path.</li>
<li>Así, org-babel/jupyter-python incrustará correctamente la imagen en el documento exportado.</li>
</ul>

<hr />

<blockquote>
<hr />
<hr />
<p>
<b><i>Consulta</i></b>:
<i>Sin embargo. Cuando ejecuto localmente el fichero org sí se crean las figuras en mi disco. ¿Hay algún modo de que también se creen con Actions sin modificar los bloques? Es decir, ¿hay algún modo de que funcionen tal y como están ahora mismo?</i>
</p>
<hr />
<hr />
</blockquote>

<p>
¡Esta es una pregunta muy frecuente al usar org-babel/jupyter en entornos CI/CD!  
La diferencia entre tu entorno local y GitHub Actions suele deberse a <b>la configuración del entorno gráfico</b> y de <b>matplotlib</b>.
</p>

<hr />
</div>
</li>
<li><a id="org06ccdd1"></a>¿Por qué funciona localmente pero no en Actions?<br />
<div class="outline-text-5" id="text-org06ccdd1">
<ul class="org-ul">
<li><b>Localmente</b>, matplotlib tiene acceso a un entorno gráfico (X11, Wayland, etc.) y suele usar un backend como `TkAgg`, `Qt5Agg`,…</li>
<li><b>En GitHub Actions</b> (o cualquier entorno headless), <b>matplotlib no tiene acceso a un display</b> y por defecto puede intentar usar un backend que requiere uno, lo que impide guardar imágenes.</li>
</ul>
</div>
<ul class="org-ul">
<li><a id="orga49fc46"></a>Backend headless necesario<br />
<div class="outline-text-6" id="text-orga49fc46">
<p>
Para guardar imágenes sin display, <b>matplotlib debe usar un backend como "Agg"</b>.
</p>

<hr />
</div>
</li>
</ul>
</li>
<li><a id="org241955d"></a>Solución: Forzar el backend "Agg" para matplotlib<br />
<div class="outline-text-5" id="text-org241955d">
<p>
Esto se puede hacer <b>sin modificar los bloques</b> añadiendo una configuración previa en tu flujo de trabajo o al comienzo de la ejecución.
</p>
</div>
<ul class="org-ul">
<li><a id="orgae98947"></a>Opción 1: Variable de entorno en el workflow<br />
<div class="outline-text-6" id="text-orgae98947">
<p>
Añade esto antes de ejecutar Emacs en tu `build.yml`:
</p>

<div class="org-src-container">
<pre class="src src-yaml"><code>- name: Set MPLBACKEND (matplotlib)
  run: echo "MPLBACKEND=Agg" &gt;&gt; $GITHUB_ENV
</code></pre>
</div>

<p>
Matplotlib detectará esto y usará el backend adecuado.
</p>
</div>
</li>
