org-publish.org
***** Opción 2: Variable de entorno en shell

O directamente en el comando de ejecución:

#+BEGIN_SRC bash
MPLBACKEND=Agg emacs -Q -l ~/Software/scimax/init.el ./lecciones/Lecc01.org --batch ...
#+END_SRC

***** Opción 3: Configuración en Emacs/jupyter-python

Si puedes modificar la configuración de Emacs que se carga, añade a tu init.el o a la cabecera de los bloques:

#+BEGIN_SRC python
import matplotlib
matplotlib.use("Agg")
#+END_SRC

Pero esto requeriría modificar los bloques, que quieres evitar.

-----

**** Resumen

- *El problema*: matplotlib necesita el backend "Agg" para funcionar headless.
- *La solución sin modificar los bloques*: establece la variable de entorno `MPLBACKEND=Agg` en el workflow antes de ejecutar Emacs.
- *Así*, los bloques que generan imágenes funcionarán igual en Actions que localmente, *sin necesidad de cambiar el código de los bloques*.

-----
-----
-----
*/SOLUCIÓN FINALMENTE ADOPTADA/*:

El backend "Agg"  no me funcionó, por lo que opté por indicar explícitamente en el código de python el fichero donde se debe guardar cada figura.
-----
-----
-----


*** Consulta sobre los núcleos de Jupyter

Cuando ejecuto Actions en GitHub y Actions ejecuta un notebook de jupyter ¿En qué directorio lo hace? Me gustaria matar los procesos  python3 -m ipykernel_launcher tras ejecutar los notebooks

**** Respuesta

Cuando GitHub Actions ejecuta un notebook de Jupyter, lo hace en un entorno temporal que se crea para cada ejecución de la acción. Usualmente, el directorio de trabajo es el que se especifica en el archivo de configuración (`.yml`) de la acción, comúnmente en el directorio del repositorio.

Si deseas matar los procesos de Jupyter después de que se ejecute un notebook en GitHub Actions, puedes agregar un paso en tu flujo de trabajo (workflow) que use un comando como `pkill` para terminar los procesos de Jupyter, tal como:

```yaml
- name: Kill Jupyter processes
  run: pkill -f "python3 -m ipykernel_launcher"
```

Sin embargo, ten en cuenta que los entornos de GitHub Actions se eliminan después de que una ejecución finaliza, por lo que normalmente no es necesario matar procesos manualmente al final del trabajo.

*** GitHub tokens

Para solucionar el error de autenticación debido a un token de GitHub caducado y usar un nuevo token, sigue estos pasos:

1. Genera un nuevo personal access token (PAT)
Ve a tu perfil de GitHub > Settings > Developer settings > Personal access tokens.
Haz clic en “Generate new token”.
Selecciona los scopes necesarios. Para subir a GitHub Pages y realizar pushes, selecciona:
repo (para acceso completo a los repositorios privados/públicos)
workflow (si tu workflow lo requiere)
Copia el token generado (no podrás verlo de nuevo).


2. Guarda el nuevo token en los Secrets del repositorio
Ve al repositorio: https://github.com/mbujosab/Econometria-Aplicada
Settings > Secrets and variables > Actions.
Haz clic en “New repository secret”.
Nombra el secret, por ejemplo: GH_TOKEN o PERSONAL_TOKEN.
Pega el token generado y guarda.
3. Actualiza tu workflow para usar el nuevo token
En tu archivo .github/workflows/build.yml (o el que corresponda), asegúrate de que el paso que hace git push o usa el token esté así:

YAML
- name: Push to GitHub Pages
  run: git push origin gh-pages
  env:
    GITHUB_TOKEN: ${{ secrets.GH_TOKEN }} # O el nombre que hayas puesto
O, si usas una acción como peaceiris/actions-gh-pages:

YAML
- name: Deploy to GitHub Pages
  uses: peaceiris/actions-gh-pages@v3
  with:
    github_token: ${{ secrets.GH_TOKEN }}
4. Confirma que el token tiene los permisos adecuados
El token debe tener acceso de escritura al repo.
Si usas una acción (como actions/checkout o actions-gh-pages), asegúrate de pasar el secret correcto.



