org-publish.html
<li><a id="org21b6087"></a>Opción 2: Variable de entorno en shell<br />
<div class="outline-text-6" id="text-org21b6087">
<p>
O directamente en el comando de ejecución:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code><span style="font-weight: bold; font-style: italic;">MPLBACKEND</span>=Agg emacs -Q -l ~/Software/scimax/init.el ./lecciones/Lecc01.org --batch ...
</code></pre>
</div>
</div>
</li>
<li><a id="org96d1c26"></a>Opción 3: Configuración en Emacs/jupyter-python<br />
<div class="outline-text-6" id="text-org96d1c26">
<p>
Si puedes modificar la configuración de Emacs que se carga, añade a tu init.el o a la cabecera de los bloques:
</p>

<div class="org-src-container">
<pre class="src src-python"><code><span style="font-weight: bold;">import</span> matplotlib
matplotlib.use(<span style="font-style: italic;">"Agg"</span>)
</code></pre>
</div>

<p>
Pero esto requeriría modificar los bloques, que quieres evitar.
</p>

<hr />
</div>
</li>
</ul>
</li>
<li><a id="orgf646d13"></a>Resumen<br />
<div class="outline-text-5" id="text-orgf646d13">
<ul class="org-ul">
<li><b>El problema</b>: matplotlib necesita el backend "Agg" para funcionar headless.</li>
<li><b>La solución sin modificar los bloques</b>: establece la variable de entorno `MPLBACKEND=Agg` en el workflow antes de ejecutar Emacs.</li>
<li><b>Así</b>, los bloques que generan imágenes funcionarán igual en Actions que localmente, <b>sin necesidad de cambiar el código de los bloques</b>.</li>
</ul>

<hr />
<hr />
<hr />
<p>
<b><i>SOLUCIÓN FINALMENTE ADOPTADA</i></b>:
</p>

<p>
El backend "Agg"  no me funcionó, por lo que opté por indicar explícitamente en el código de python el fichero donde se debe guardar cada figura.
</p>
<hr />
<hr />
<hr />
</div>
</li>
</ul>
</div>
<div id="outline-container-orga8060aa" class="outline-4">
<h4 id="orga8060aa">Consulta sobre los núcleos de Jupyter</h4>
<div class="outline-text-4" id="text-orga8060aa">
<p>
Cuando ejecuto Actions en GitHub y Actions ejecuta un notebook de jupyter ¿En qué directorio lo hace? Me gustaria matar los procesos  python3 -m ipykernel_launcher tras ejecutar los notebooks
</p>
</div>
<ul class="org-ul">
<li><a id="org03f6cfc"></a>Respuesta<br />
<div class="outline-text-5" id="text-org03f6cfc">
<p>
Cuando GitHub Actions ejecuta un notebook de Jupyter, lo hace en un entorno temporal que se crea para cada ejecución de la acción. Usualmente, el directorio de trabajo es el que se especifica en el archivo de configuración (`.yml`) de la acción, comúnmente en el directorio del repositorio.
</p>

<p>
Si deseas matar los procesos de Jupyter después de que se ejecute un notebook en GitHub Actions, puedes agregar un paso en tu flujo de trabajo (workflow) que use un comando como `pkill` para terminar los procesos de Jupyter, tal como:
</p>

<p>
```yaml
</p>
<ul class="org-ul">
<li>name: Kill Jupyter processes
run: pkill -f "python3 -m ipykernel_launcher"</li>
</ul>
<p>
```
</p>

<p>
Sin embargo, ten en cuenta que los entornos de GitHub Actions se eliminan después de que una ejecución finaliza, por lo que normalmente no es necesario matar procesos manualmente al final del trabajo.
</p>
</div>
</li>
</ul>
</div>
<div id="outline-container-orgfc89a62" class="outline-4">
<h4 id="orgfc89a62">GitHub tokens</h4>
<div class="outline-text-4" id="text-orgfc89a62">
<p>
Para solucionar el error de autenticación debido a un token de GitHub caducado y usar un nuevo token, sigue estos pasos:
</p>

<ol class="org-ol">
<li>Genera un nuevo personal access token (PAT)</li>
</ol>
<p>
Ve a tu perfil de GitHub &gt; Settings &gt; Developer settings &gt; Personal access tokens.
Haz clic en “Generate new token”.
Selecciona los scopes necesarios. Para subir a GitHub Pages y realizar pushes, selecciona:
repo (para acceso completo a los repositorios privados/públicos)
workflow (si tu workflow lo requiere)
Copia el token generado (no podrás verlo de nuevo).
</p>


<ol class="org-ol">
<li>Guarda el nuevo token en los Secrets del repositorio</li>
</ol>
<p>
Ve al repositorio: <a href="https://github.com/mbujosab/Econometria-Aplicada">https://github.com/mbujosab/Econometria-Aplicada</a>
Settings &gt; Secrets and variables &gt; Actions.
Haz clic en “New repository secret”.
Nombra el secret, por ejemplo: GH_TOKEN o PERSONAL_TOKEN.
Pega el token generado y guarda.
</p>
<ol class="org-ol">
<li>Actualiza tu workflow para usar el nuevo token</li>
</ol>
<p>
En tu archivo .github/workflows/build.yml (o el que corresponda), asegúrate de que el paso que hace git push o usa el token esté así:
</p>

<p>
YAML
</p>
<ul class="org-ul">
<li>name: Push to GitHub Pages
run: git push origin gh-pages
env:
  GITHUB_TOKEN: ${{ secrets.GH_TOKEN }} # O el nombre que hayas puesto</li>
</ul>
<p>
O, si usas una acción como peaceiris/actions-gh-pages:
</p>

<p>
YAML
</p>
<ul class="org-ul">
<li>name: Deploy to GitHub Pages
uses: peaceiris/actions-gh-pages@v3
with:
  github_token: ${{ secrets.GH_TOKEN }}</li>
<li>Confirma que el token tiene los permisos adecuados</li>
</ul>
<p>
El token debe tener acceso de escritura al repo.
Si usas una acción (como actions/checkout o actions-gh-pages), asegúrate de pasar el secret correcto.
</p>
</div>
</div>
</div>
</div>
