org-publish.org
* Script =publica.el= de elisp para publicar las lecciones con formato =.org= como ficheros con formato =pdf= y ~html~

Este script transforma los ficheros org de las lecciones en pdfs y htmls. 

#+BEGIN_SRC  emacs-lisp :tangle publica.el :results silent
;;; publica.el --- Publicación HTML y PDF para el repositorio 

(require 'ox-publish)

(setq org-confirm-babel-evaluate nil
      org-export-with-broken-links t
      org-html-validation-link nil
      org-html-head-include-scripts nil
      org-html-head-include-default-style nil)

(defun my-org-latex-publish-to-pdf (plist filename pub-dir)
  "Publica un archivo Org como PDF tras ejecutar bloques de código."
  (message "Exportando a PDF: %s" filename)
  (with-current-buffer (find-file-noselect filename)
    (org-babel-execute-buffer)
    (sleep-for 25)
    (save-buffer)
    (org-latex-publish-to-pdf plist filename pub-dir)))

;; (defun my-org-html-publish-to-html (plist filename pub-dir)
;;   "Publica un archivo Org como PDF tras ejecutar bloques de código."
;;   (message "Exportando a html: %s" filename)
;;   (with-current-buffer (find-file-noselect filename)
;;     (org-babel-execute-buffer)
;;     (sleep-for 20)
;;     (org-html-publish-to-html plist filename pub-dir)))

(let* ((base-directory "./"))
  (setq org-publish-project-alist
        (append org-publish-project-alist
                `(("index"
                   :base-directory ,base-directory
                   :base-extension "org"
                   :publishing-directory ,(concat base-directory "docs")
                   :exclude "Calendario\\|org-lessons\\|org-practicas\\|docs\\|Lecciones-tmp\\|Practicas-tmp\\|org-publish.org\\|README.org\\|CriteriosEvaluacion.org\\datos"
                   :recursive t
                   :publishing-function org-html-publish-to-html
                   :auto-preamble t
                   :auto-sitemap nil
                   :with-author nil
                   :with-creator nil
                   :with-toc t
                   :section-numbers nil)

                  ("pdf"
                   :base-directory "./Lecciones-tmp/"
                   :base-extension "org"
                   :publishing-directory ,(concat base-directory "docs/Lecciones-pdf")
                   :exclude "README.org\\|sitemap.org\\datos"
                   :recursive t
                   :auto-sitemap nil
                   :publishing-function my-org-latex-publish-to-pdf
                   :auto-preamble t)
		  
                  ("html"
                   :base-directory  "./Lecciones-tmp/"
                   :base-extension "org"
                   :publishing-directory ,(concat base-directory "docs/Lecciones-html")
                   :exclude "README.org\\datos"
                   :recursive t
                   :publishing-function org-html-publish-to-html ; my-org-html-publish-to-html ; 
                   :auto-preamble t
                   :auto-sitemap t
                   :with-author nil
                   :with-creator nil
                   :with-toc t
                   :section-numbers nil)

                  ("static-index"
                   :base-directory ,base-directory
                   :base-extension "css\\|js\\|png\\|jpg\\|gif\\|dat\\|mov\\|txt\\|svg\\|aiff\\|inp"
                   :publishing-directory ,(concat base-directory "docs")
                   :exclude "src\\|Calendario\\|org-lessons\\|org-practicas\\|Lecciones-tmp\\|Practicas-tmp\\|docs\\|org-publish.*\\|README.org\\|CriteriosEvaluacion.org\\datos"
                   :recursive t
                   :publishing-function org-publish-attachment)

                  ("web-repositorio" :components ("index" "pdf" "html" "static-index")))))

  (message "🟢 Iniciando publicación del índice (web-repositorio)...")
  (org-publish "web-repositorio" t)
  (message "✅ Publicación del índice completada."))

#+END_SRC

# (unless (file-directory-p "logs")
#   (make-directory "logs"))
# (with-temp-file "logs/publica.log"
#   (insert (format "Publicado el %s\n" (current-time-string))))

Podemos chequear la versión local ejecutando en emacs el siguiente bloque

#+BEGIN_SRC emacs-lisp :results silent
(browse-url "docs/index.html")
#+END_SRC


