org-publish.html
<div id="outline-container-org002f7dd" class="outline-2">
<h2 id="org002f7dd">Script <code>publica.el</code> de elisp para publicar las lecciones con formato <code>.org</code> como ficheros con formato <code>pdf</code> y <code>html</code></h2>
<div class="outline-text-2" id="text-org002f7dd">
<p>
Este script transforma los ficheros org de las lecciones en pdfs y htmls. 
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><code><span style="font-weight: bold; font-style: italic;">;;; </span><span style="font-weight: bold; font-style: italic;">publica.el --- Publicaci&#243;n HTML y PDF para el repositorio Scimax-ELN
</span>
(<span style="font-weight: bold;">require</span> '<span style="font-weight: bold; text-decoration: underline;">ox-publish</span>)

(<span style="font-weight: bold;">setq</span> org-confirm-babel-evaluate nil
      org-export-with-broken-links t
      org-html-validation-link nil
      org-html-head-include-scripts nil
      org-html-head-include-default-style nil)

(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">my-org-latex-publish-to-pdf</span> (plist filename pub-dir)
  <span style="font-style: italic;">"Publica un archivo Org como PDF tras ejecutar bloques de c&#243;digo."</span>
  (message <span style="font-style: italic;">"Exportando a PDF: %s"</span> filename)
  (<span style="font-weight: bold;">with-current-buffer</span> (find-file-noselect filename)
    (org-babel-execute-buffer)
    (sleep-for 25)
    (save-buffer)
    (org-latex-publish-to-pdf plist filename pub-dir)))

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">(defun my-org-html-publish-to-html (plist filename pub-dir)
</span><span style="font-weight: bold; font-style: italic;">;;   </span><span style="font-weight: bold; font-style: italic;">"Publica un archivo Org como PDF tras ejecutar bloques de c&#243;digo."
</span><span style="font-weight: bold; font-style: italic;">;;   </span><span style="font-weight: bold; font-style: italic;">(message "Exportando a html: %s" filename)
</span><span style="font-weight: bold; font-style: italic;">;;   </span><span style="font-weight: bold; font-style: italic;">(with-current-buffer (find-file-noselect filename)
</span><span style="font-weight: bold; font-style: italic;">;;     </span><span style="font-weight: bold; font-style: italic;">(org-babel-execute-buffer)
</span><span style="font-weight: bold; font-style: italic;">;;     </span><span style="font-weight: bold; font-style: italic;">(sleep-for 20)
</span><span style="font-weight: bold; font-style: italic;">;;     </span><span style="font-weight: bold; font-style: italic;">(org-html-publish-to-html plist filename pub-dir)))
</span>
(<span style="font-weight: bold;">let*</span> ((base-directory <span style="font-style: italic;">"./"</span>))
  (<span style="font-weight: bold;">setq</span> org-publish-project-alist
        (append org-publish-project-alist
                `((<span style="font-style: italic;">"index"</span>
                   <span style="font-weight: bold;">:base-directory</span> ,base-directory
                   <span style="font-weight: bold;">:base-extension</span> <span style="font-style: italic;">"org"</span>
                   <span style="font-weight: bold;">:publishing-directory</span> ,(concat base-directory <span style="font-style: italic;">"docs"</span>)
                   <span style="font-weight: bold;">:exclude</span> <span style="font-style: italic;">"Calendario</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">org-lessons</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">org-practicas</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">docs</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">Lecciones-tmp</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">Practicas-tmp</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">org-publish.org</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">README.org</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">CriteriosEvaluacion.org\\datos"</span>
                   <span style="font-weight: bold;">:recursive</span> t
                   <span style="font-weight: bold;">:publishing-function</span> org-html-publish-to-html
                   <span style="font-weight: bold;">:auto-preamble</span> t
                   <span style="font-weight: bold;">:auto-sitemap</span> nil
                   <span style="font-weight: bold;">:with-author</span> nil
                   <span style="font-weight: bold;">:with-creator</span> nil
                   <span style="font-weight: bold;">:with-toc</span> t
                   <span style="font-weight: bold;">:section-numbers</span> nil)

                  (<span style="font-style: italic;">"pdf"</span>
                   <span style="font-weight: bold;">:base-directory</span> <span style="font-style: italic;">"./Lecciones-tmp/"</span>
                   <span style="font-weight: bold;">:base-extension</span> <span style="font-style: italic;">"org"</span>
                   <span style="font-weight: bold;">:publishing-directory</span> ,(concat base-directory <span style="font-style: italic;">"docs/Lecciones-pdf"</span>)
                   <span style="font-weight: bold;">:exclude</span> <span style="font-style: italic;">"README.org</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">sitemap.org\\datos"</span>
                   <span style="font-weight: bold;">:recursive</span> t
                   <span style="font-weight: bold;">:auto-sitemap</span> nil
                   <span style="font-weight: bold;">:publishing-function</span> my-org-latex-publish-to-pdf
                   <span style="font-weight: bold;">:auto-preamble</span> t)
                  
                  (<span style="font-style: italic;">"html"</span>
                   <span style="font-weight: bold;">:base-directory</span>  <span style="font-style: italic;">"./Lecciones-tmp/"</span>
                   <span style="font-weight: bold;">:base-extension</span> <span style="font-style: italic;">"org"</span>
                   <span style="font-weight: bold;">:publishing-directory</span> ,(concat base-directory <span style="font-style: italic;">"docs/Lecciones-html"</span>)
                   <span style="font-weight: bold;">:exclude</span> <span style="font-style: italic;">"README.org\\datos"</span>
                   <span style="font-weight: bold;">:recursive</span> t
                   <span style="font-weight: bold;">:publishing-function</span> org-html-publish-to-html <span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">my-org-html-publish-to-html ; 
</span>                   <span style="font-weight: bold;">:auto-preamble</span> t
                   <span style="font-weight: bold;">:auto-sitemap</span> t
                   <span style="font-weight: bold;">:with-author</span> nil
                   <span style="font-weight: bold;">:with-creator</span> nil
                   <span style="font-weight: bold;">:with-toc</span> t
                   <span style="font-weight: bold;">:section-numbers</span> nil)

                  (<span style="font-style: italic;">"static-index"</span>
                   <span style="font-weight: bold;">:base-directory</span> ,base-directory
                   <span style="font-weight: bold;">:base-extension</span> <span style="font-style: italic;">"css</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">js</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">png</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">jpg</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">gif</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">dat</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">mov</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">txt</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">svg</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">aiff</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">inp"</span>
                   <span style="font-weight: bold;">:publishing-directory</span> ,(concat base-directory <span style="font-style: italic;">"docs"</span>)
                   <span style="font-weight: bold;">:exclude</span> <span style="font-style: italic;">"src</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">Calendario</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">org-lessons</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">org-practicas</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">Lecciones-tmp</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">Practicas-tmp</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">docs</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">org-publish.*</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">README.org</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">CriteriosEvaluacion.org\\datos"</span>
                   <span style="font-weight: bold;">:recursive</span> t
                   <span style="font-weight: bold;">:publishing-function</span> org-publish-attachment)

                  (<span style="font-style: italic;">"web-repositorio"</span> <span style="font-weight: bold;">:components</span> (<span style="font-style: italic;">"index"</span> <span style="font-style: italic;">"pdf"</span> <span style="font-style: italic;">"html"</span> <span style="font-style: italic;">"static-index"</span>)))))

  (message <span style="font-style: italic;">"&#128994; Iniciando publicaci&#243;n del &#237;ndice (web-repositorio)..."</span>)
  (org-publish <span style="font-style: italic;">"web-repositorio"</span> t)
  (message <span style="font-style: italic;">"&#9989; Publicaci&#243;n del &#237;ndice completada."</span>))

</code></pre>
</div>

<p>
Podemos chequear la versión local ejecutando en emacs el siguiente bloque
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><code>(browse-url <span style="font-style: italic;">"docs/index.html"</span>)
</code></pre>
</div>
</div>
</div>
