org-publish.org
* Script =publica-practicas.el= de elisp para publicar las prácticas con formato =.org= como ficheros con formato =pdf= y ~html~

Este script transforma los ficheros org de las lecciones en pdfs y htmls. 

#+BEGIN_SRC  emacs-lisp :tangle publica-practicas.el :results silent
;;; publica.el --- Publicación HTML y PDF de las prácticas para el repositorio


;; Lo siguiente es para que se vean en pdf los bloques de código hanls
;; Añade "listings" a org-latex-packages-alist
(add-to-list 'org-latex-packages-alist '("" "listings"))
;; Establece 'listings como valor para org-latex-listings
(setq org-latex-listings 'listings)
;(setq org-latex-listings 'minted)


(require 'ox-publish)

(setq org-confirm-babel-evaluate nil
      org-export-with-broken-links t
      org-html-validation-link nil
      org-html-head-include-scripts nil
      org-html-head-include-default-style nil)

(defun my-org-latex-publish-to-pdf (plist filename pub-dir)
  "Publica un archivo Org como PDF tras ejecutar bloques de código."
  (message "Exportando a PDF: %s" filename)
  (with-current-buffer (find-file-noselect filename)
    ;(org-babel-execute-buffer)
    ;(org-latex-export-to-pdf)
    (org-latex-publish-to-pdf plist filename pub-dir)))

(let* ((base-directory "./"))
  (setq org-publish-project-alist
        (append org-publish-project-alist
                `(("index"
                   :base-directory ,base-directory
                   :base-extension "org"
                   :publishing-directory ,(concat base-directory "docs")
                   :exclude "src\\|Calendario\\|org-lessons\\|org-practicas\\|docs\\|Lecciones-tmp\\|Practicas-tmp\\datos"
                   :recursive nil
                   :publishing-function org-html-publish-to-html
                   :auto-preamble t
                   :auto-sitemap nil
                   :with-author nil
                   :with-creator nil
                   :with-toc t
                   :section-numbers nil)

                  ("practicas-html"
                   :base-directory  "./Practicas-tmp/"
                   :base-extension "org"
                   :publishing-directory ,(concat base-directory "docs/Practicas-html")
                   :exclude "datos"
                   :recursive t
                   :publishing-function org-html-publish-to-html
                   :auto-preamble t
                   :auto-sitemap t
                   :with-author nil
                   :with-creator nil
                   :with-toc t
                   :section-numbers nil)

                  ("practicas-pdf"
                   :base-directory "./Practicas-tmp/"
                   :base-extension "org"
                   :publishing-directory ,(concat base-directory "docs/Practicas-pdf")
                   :exclude "datos\\|sitemap.org"
                   :recursive t
                   :auto-sitemap nil
                   :publishing-function my-org-latex-publish-to-pdf
                   :auto-preamble t)

                  ("practicas-static-index"
                   :base-directory "./Practicas-tmp/"
                   :base-extension "css\\|js\\|png\\|jpg\\|gif\\|dat\\|mov\\|txt\\|svg\\|aiff\\|inp"
                   :publishing-directory ,(concat base-directory "docs/Practicas-html")
                   :exclude "datos\\|hansl.tex"
                   :recursive t
                   :publishing-function org-publish-attachment)

                  ("web-repositorio" :components ("index" "practicas-html" "practicas-pdf" "practicas-static-index")))))

  (message "🟢 Iniciando publicación del índice (web-repositorio)...")
  (org-publish "web-repositorio" t)
  (message "✅ Publicación del índice completada."))

#+END_SRC


