org-publish.html
<div id="outline-container-org0826d3c" class="outline-2">
<h2 id="org0826d3c">Script <code>publica-practicas.el</code> de elisp para publicar las prácticas con formato <code>.org</code> como ficheros con formato <code>pdf</code> y <code>html</code></h2>
<div class="outline-text-2" id="text-org0826d3c">
<p>
Este script transforma los ficheros org de las lecciones en pdfs y htmls. 
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><code><span style="font-weight: bold; font-style: italic;">;;; </span><span style="font-weight: bold; font-style: italic;">publica.el --- Publicaci&#243;n HTML y PDF de las pr&#225;cticas para el repositorio
</span>

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Lo siguiente es para que se vean en pdf los bloques de c&#243;digo hanls
</span><span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">A&#241;ade "listings" a org-latex-packages-alist
</span>(add-to-list 'org-latex-packages-alist '(<span style="font-style: italic;">""</span> <span style="font-style: italic;">"listings"</span>))
<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Establece 'listings como valor para org-latex-listings
</span>(<span style="font-weight: bold;">setq</span> org-latex-listings 'listings)
<span style="font-weight: bold; font-style: italic;">;</span><span style="font-weight: bold; font-style: italic;">(setq org-latex-listings 'minted)
</span>

(<span style="font-weight: bold;">require</span> '<span style="font-weight: bold; text-decoration: underline;">ox-publish</span>)

(<span style="font-weight: bold;">setq</span> org-confirm-babel-evaluate nil
      org-export-with-broken-links t
      org-html-validation-link nil
      org-html-head-include-scripts nil
      org-html-head-include-default-style nil)

(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">my-org-latex-publish-to-pdf</span> (plist filename pub-dir)
  <span style="font-style: italic;">"Publica un archivo Org como PDF tras ejecutar bloques de c&#243;digo."</span>
  (message <span style="font-style: italic;">"Exportando a PDF: %s"</span> filename)
  (<span style="font-weight: bold;">with-current-buffer</span> (find-file-noselect filename)
    <span style="font-weight: bold; font-style: italic;">;</span><span style="font-weight: bold; font-style: italic;">(org-babel-execute-buffer)
</span>    <span style="font-weight: bold; font-style: italic;">;</span><span style="font-weight: bold; font-style: italic;">(org-latex-export-to-pdf)
</span>    (org-latex-publish-to-pdf plist filename pub-dir)))

(<span style="font-weight: bold;">let*</span> ((base-directory <span style="font-style: italic;">"./"</span>))
  (<span style="font-weight: bold;">setq</span> org-publish-project-alist
        (append org-publish-project-alist
                `((<span style="font-style: italic;">"index"</span>
                   <span style="font-weight: bold;">:base-directory</span> ,base-directory
                   <span style="font-weight: bold;">:base-extension</span> <span style="font-style: italic;">"org"</span>
                   <span style="font-weight: bold;">:publishing-directory</span> ,(concat base-directory <span style="font-style: italic;">"docs"</span>)
                   <span style="font-weight: bold;">:exclude</span> <span style="font-style: italic;">"src</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">Calendario</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">org-lessons</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">org-practicas</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">docs</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">Lecciones-tmp</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">Practicas-tmp\\datos"</span>
                   <span style="font-weight: bold;">:recursive</span> nil
                   <span style="font-weight: bold;">:publishing-function</span> org-html-publish-to-html
                   <span style="font-weight: bold;">:auto-preamble</span> t
                   <span style="font-weight: bold;">:auto-sitemap</span> nil
                   <span style="font-weight: bold;">:with-author</span> nil
                   <span style="font-weight: bold;">:with-creator</span> nil
                   <span style="font-weight: bold;">:with-toc</span> t
                   <span style="font-weight: bold;">:section-numbers</span> nil)

                  (<span style="font-style: italic;">"practicas-html"</span>
                   <span style="font-weight: bold;">:base-directory</span>  <span style="font-style: italic;">"./Practicas-tmp/"</span>
                   <span style="font-weight: bold;">:base-extension</span> <span style="font-style: italic;">"org"</span>
                   <span style="font-weight: bold;">:publishing-directory</span> ,(concat base-directory <span style="font-style: italic;">"docs/Practicas-html"</span>)
                   <span style="font-weight: bold;">:exclude</span> <span style="font-style: italic;">"datos"</span>
                   <span style="font-weight: bold;">:recursive</span> t
                   <span style="font-weight: bold;">:publishing-function</span> org-html-publish-to-html
                   <span style="font-weight: bold;">:auto-preamble</span> t
                   <span style="font-weight: bold;">:auto-sitemap</span> t
                   <span style="font-weight: bold;">:with-author</span> nil
                   <span style="font-weight: bold;">:with-creator</span> nil
                   <span style="font-weight: bold;">:with-toc</span> t
                   <span style="font-weight: bold;">:section-numbers</span> nil)

                  (<span style="font-style: italic;">"practicas-pdf"</span>
                   <span style="font-weight: bold;">:base-directory</span> <span style="font-style: italic;">"./Practicas-tmp/"</span>
                   <span style="font-weight: bold;">:base-extension</span> <span style="font-style: italic;">"org"</span>
                   <span style="font-weight: bold;">:publishing-directory</span> ,(concat base-directory <span style="font-style: italic;">"docs/Practicas-pdf"</span>)
                   <span style="font-weight: bold;">:exclude</span> <span style="font-style: italic;">"datos</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">sitemap.org"</span>
                   <span style="font-weight: bold;">:recursive</span> t
                   <span style="font-weight: bold;">:auto-sitemap</span> nil
                   <span style="font-weight: bold;">:publishing-function</span> my-org-latex-publish-to-pdf
                   <span style="font-weight: bold;">:auto-preamble</span> t)

                  (<span style="font-style: italic;">"practicas-static-index"</span>
                   <span style="font-weight: bold;">:base-directory</span> <span style="font-style: italic;">"./Practicas-tmp/"</span>
                   <span style="font-weight: bold;">:base-extension</span> <span style="font-style: italic;">"css</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">js</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">png</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">jpg</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">gif</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">dat</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">mov</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">txt</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">svg</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">aiff</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">inp"</span>
                   <span style="font-weight: bold;">:publishing-directory</span> ,(concat base-directory <span style="font-style: italic;">"docs/Practicas-html"</span>)
                   <span style="font-weight: bold;">:exclude</span> <span style="font-style: italic;">"datos</span><span style="font-weight: bold; font-style: italic;">\\</span><span style="font-weight: bold; font-style: italic;">|</span><span style="font-style: italic;">hansl.tex"</span>
                   <span style="font-weight: bold;">:recursive</span> t
                   <span style="font-weight: bold;">:publishing-function</span> org-publish-attachment)

                  (<span style="font-style: italic;">"web-repositorio"</span> <span style="font-weight: bold;">:components</span> (<span style="font-style: italic;">"index"</span> <span style="font-style: italic;">"practicas-html"</span> <span style="font-style: italic;">"practicas-pdf"</span> <span style="font-style: italic;">"practicas-static-index"</span>)))))

  (message <span style="font-style: italic;">"&#128994; Iniciando publicaci&#243;n del &#237;ndice (web-repositorio)..."</span>)
  (org-publish <span style="font-style: italic;">"web-repositorio"</span> t)
  (message <span style="font-style: italic;">"&#9989; Publicaci&#243;n del &#237;ndice completada."</span>))

</code></pre>
</div>
</div>
</div>
