org-publish.html
<div id="outline-container-orgd0f31b6" class="outline-2">
<h2 id="orgd0f31b6">slides para GitHubpages</h2>
<div class="outline-text-2" id="text-orgd0f31b6">
<p>
Esta es la configuración para convertir los Notebooks de Jupyter en slides:
</p>
<div class="org-src-container">
<pre class="src src-python"><code><span style="font-weight: bold; font-style: italic;">c</span> = get_config()

c.SlidesExporter.<span style="font-weight: bold; font-style: italic;">reveal_theme</span> = <span style="font-style: italic;">'solarized'</span>
c.SlidesExporter.<span style="font-weight: bold; font-style: italic;">reveal_scroll</span> = <span style="font-weight: bold; text-decoration: underline;">True</span>
c.SlidesExporter.<span style="font-weight: bold; font-style: italic;">language_code</span> = <span style="font-style: italic;">'es'</span>

c.SlidesExporter.<span style="font-weight: bold; font-style: italic;">mathjax_url</span> = <span style="font-style: italic;">"https://cdn.mathjax.org/mathjax/latest/MathJax.js?config=TeX-AMS_HTML"</span>

c.SlidesExporter.<span style="font-weight: bold; font-style: italic;">jquery_url</span> = <span style="font-style: italic;">"https://cdnjs.cloudflare.com/ajax/libs/jquery/3.6.0/jquery.min.js"</span>

c.SlidesExporter.<span style="font-weight: bold; font-style: italic;">require_js_url</span> = <span style="font-style: italic;">"https://cdnjs.cloudflare.com/ajax/libs/require.js/2.3.6/require.min.js"</span>
</code></pre>
</div>


<p>
<a href="https://nbconvert.readthedocs.io/en/latest/config_options.html">Configuración para nbconvert</a> (las slides usan ficheros de la web para poder funcionar en GitHubPages)
</p>

<p>
<a href="https://dbafromthecold.com/2021/02/21/creating-presentations-with-reveal-and-github-pages/">creating-presentations-with-reveal-and-github-pages</a>
</p>

<p>
<a href="https://github.com/RichardAfolabi/Presentation_js">https://github.com/RichardAfolabi/Presentation_js</a>
</p>

<p>
<a href="https://emasuriano.com/til/2024-07-01-create-presentations-from-notebook/">https://emasuriano.com/til/2024-07-01-create-presentations-from-notebook/</a>
</p>

<p>
<a href="https://github.com/yjwen/org-reveal">https://github.com/yjwen/org-reveal</a>
<a href="https://github.com/hexmode/ox-reveal">https://github.com/hexmode/ox-reveal</a>
</p>
</div>
</div>
<div id="outline-container-org242c09f" class="outline-2">
<h2 id="org242c09f">Directorio <code>.binder</code> para MyBinder</h2>
<div class="outline-text-2" id="text-org242c09f">
</div>
<div id="outline-container-org0a7e471" class="outline-3">
<h3 id="org0a7e471">Fichero <code>environment.yml</code></h3>
<div class="outline-text-3" id="text-org0a7e471">
<p>
Dado que los notebooks del curso emplean algunos módulos de python, la ejecución online en <a href="https://mybinder.org/">MyBinder</a> de los correspondientes Notebooks de Jupyter requiere de la creación de un fichero que indique las dependencias necesarias para que se instale el software necesario (creo que <code>defaults</code> instala el latex necesario para los gráficos). 
</p>

<div class="org-src-container">
<pre class="src src-yml"><code>name: binder-env
channels:
  - conda-forge
  - defaults
dependencies:
  - python=3.11
  - pip
  - ipykernel
  - numpy
  - pandas
  - matplotlib
  - seaborn
  - sympy
  - statsmodels
  - scipy
  - pillow  # Biblioteca necesaria para manipulación de imágenes (grafico arcoiris)
  - pip:
      - dataframe_image
</code></pre>
</div>
</div>
</div>
<div id="outline-container-org46ddf4c" class="outline-3">
<h3 id="org46ddf4c">Fichero <code>apt.txt</code></h3>
<div class="outline-text-3" id="text-org46ddf4c">
<p>
Algunos gráficos de los notebooks usan \LaTeX{}. Este fichero indica a MyBinder qué paquetes debe instalar para cubrir las dependencias.
</p>

<div class="org-src-container">
<pre class="src src-text"><code>texlive
texlive-latex-extra
texlive-fonts-recommended
texlive-fonts-extra
dvipng
cm-super
</code></pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2025-10-25 Sat 22:46</p>
</div>
</body>
</html>
